[
  {
    "SessionId": 1,
    "BeginDateTime": "2024-11-12T08:00:00-08:00",
    "EndDateTime": "2024-11-12T09:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T00:00:00Z",
    "EndDateTimeInCST": "2024-11-13T01:00:00Z",
    "Title": "Keynote - Welcome to .NET 9",
    "Speaker": "James Montemagno, Damian Edwards, Maddy Montaquila, Maria Naggaga, Steve Sanderson, Safia Abdalla, Daniel Roth, David Ortinau, Filisha Shah",
    "Description": ".NET 9 is here elevating cloud-native and intelligent app development, focusing on productivity enhancements, streamlined deployments, and accelerated AI integration, ensuring superior performance for developers across various applications."
  },
  {
    "SessionId": 2,
    "BeginDateTime": "2024-11-12T09:00:00-08:00",
    "EndDateTime": "2024-11-12T09:45:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T01:00:00Z",
    "EndDateTimeInCST": "2024-11-13T01:45:00Z",
    "Title": "What's new in .NET Aspire",
    "Speaker": "Maddy Montaquila, Damian Edwards",
    "Description": ".NET Aspire 9.0 is packed with new features to streamline your app development. New dashboard updates, custom commands, more powerful container start/stop/lifecycle management, new Integrations, and preview support for Azure Functions are packed into this release. Join .NET Product Managers Damian Edwards and Maddy Montaquila to find out why you should be using .NET Aspire in all your apps, and how .NET 9 will make them even better!"
  },
  {
    "SessionId": 3,
    "BeginDateTime": "2024-11-12T09:45:00-08:00",
    "EndDateTime": "2024-11-12T10:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T01:45:00Z",
    "EndDateTimeInCST": "2024-11-13T02:30:00Z",
    "Title": "AI Building Blocks - A new, unified AI layer",
    "Speaker": "Steve Sanderson",
    "Description": "Most .NET apps can be made more powerful and productive through AI features, such as semantic search, auto-classification, summarization, translation, data extraction, and even chat-based assistants. But until now there's been no single standard representation for AI concepts within .NET itself, so developers needed to combine many unrelated APIs.\r\n \r\nMicrosoft.Extensions.AI addresses this by providing a new set of standard APIs for AI services, including large language models (LLMs) running locally on your workstation or as hosted services, integrating with text embeddings, vector stores, and more.\r\n \r\nIn this talk we'll demonstrate how these new standard abstractions let you combine multiple services that can easily be swapped and changed over time, and how you can plug into the internals for more advanced scenarios. By the end you'll be ready to start experimenting with new AI features in your own apps."
  },
  {
    "SessionId": 4,
    "BeginDateTime": "2024-11-12T10:30:00-08:00",
    "EndDateTime": "2024-11-12T11:15:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T02:30:00Z",
    "EndDateTimeInCST": "2024-11-13T03:15:00Z",
    "Title": "What's new in C# 13",
    "Speaker": "Mads Torgersen, Dustin Campbell",
    "Description": "Join Mads and Dustin from the C# design team as they take you through new features in C# 13 and beyond."
  },
  {
    "SessionId": 5,
    "BeginDateTime": "2024-11-12T11:15:00-08:00",
    "EndDateTime": "2024-11-12T12:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T03:15:00Z",
    "EndDateTimeInCST": "2024-11-13T04:00:00Z",
    "Title": "What's New for ASP.NET Core & Blazor in .NET 9",
    "Speaker": "Daniel Roth",
    "Description": "In this session we'll go over all the improvements coming to ASP.NET Core & Blazor in .NET 9, including various performance improvements, optimized static web asset handling, improved Blazor reconnection logic, built-in OpenAPI support, improved distributed caching, and much more!"
  },
  {
    "SessionId": 6,
    "BeginDateTime": "2024-11-12T12:00:00-08:00",
    "EndDateTime": "2024-11-12T12:45:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T04:00:00Z",
    "EndDateTimeInCST": "2024-11-13T04:45:00Z",
    "Title": "What's New in .NET MAUI in .NET 9",
    "Speaker": "David Ortinau, Rachel Kang (SHE/HER)",
    "Description": "More and more companies are building mobile and desktop apps with .NET MAUI, and .NET 9 is now here to continue improving those business-critical app experiences. In this session we’ll introduce you to what’s new in .NET 9, how companies are being successful shipping production quality applications with .NET MAUI, and how you can get the most out of Visual Studio and Visual Studio Code."
  },
  {
    "SessionId": 7,
    "BeginDateTime": "2024-11-12T12:45:00-08:00",
    "EndDateTime": "2024-11-12T13:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T04:45:00Z",
    "EndDateTimeInCST": "2024-11-13T05:30:00Z",
    "Title": "What's new in the .NET Runtime, Libraries, & SDK",
    "Speaker": "Richard Lander, Immo Landwerth",
    "Description": "Find out about some of the exciting features .NET 9 is bringing to the runtime, libraries, and SDK! The runtime includes dynamic adaptation to application sizes for garbage collection, new attribute models for feature switches, and numerous performance enhancements. The libraries see updates like nullable reference type annotations in System.Text.Json, new LINQ methods (CountBy and AggregateBy), and a new Base64Url class for URL-safe encoding. The SDK introduces workload sets, improved unit testing integration, and enhanced NuGet security audits. Come join us to learn about .NET features you can start using today in your .NET 9 applications!"
  },
  {
    "SessionId": 8,
    "BeginDateTime": "2024-11-12T13:30:00-08:00",
    "EndDateTime": "2024-11-12T14:15:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T05:30:00Z",
    "EndDateTimeInCST": "2024-11-13T06:15:00Z",
    "Title": "Performance Improvements in .NET 9",
    "Speaker": "Stephen Toub",
    "Description": ".NET 9 is the fastest .NET to date, with a huge number of performance improvements throughout the stack. In this session, we'll take a tour through some of these optimizations and see how .NET 9 will make your applications and services fly."
  },
  {
    "SessionId": 9,
    "BeginDateTime": "2024-11-12T14:15:00-08:00",
    "EndDateTime": "2024-11-12T14:45:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T06:15:00Z",
    "EndDateTimeInCST": "2024-11-13T06:45:00Z",
    "Title": "Building AI Applications from Scratch: A Hands-On Guide for .NET Developers",
    "Speaker": "Luis Quintanilla",
    "Description": "In this session, we'll guide you through the process of developing AI applications using .NET, Aspire, and Azure. Through live demonstrations, we’ll start by constructing a prototype AI application, showcasing how the same codebase and concepts can be adapted across different platforms. We’ll then explore how to scale this prototype into a robust enterprise AI solution using .NET Aspire, and demonstrate how .NET Aspire can be used to monitor your AI applications effectively. Lastly, we’ll walk you through the deployment process, highlighting how you can achieve comprehensive observability and production capabilities in the cloud. Join us for this hands-on session and learn how to transform your ideas into intelligent solutions."
  },
  {
    "SessionId": 10,
    "BeginDateTime": "2024-11-12T14:45:00-08:00",
    "EndDateTime": "2024-11-12T15:15:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T06:45:00Z",
    "EndDateTimeInCST": "2024-11-13T07:15:00Z",
    "Title": "API-ly Ever After: OpenAPI in .NET 9",
    "Speaker": "Safia Abdalla, Mike Kistler",
    "Description": "In .NET 9, ASP.NET Core ships with built-in support for generating OpenAPI documents from minimal and controller-based APIs. In this session, we'll cover the key features of this new support, explore integration scenarios for OpenAPI, and discuss how your team can make the most of OpenAPI."
  },
  {
    "SessionId": 11,
    "BeginDateTime": "2024-11-12T15:15:00-08:00",
    "EndDateTime": "2024-11-12T15:45:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T07:15:00Z",
    "EndDateTimeInCST": "2024-11-13T07:45:00Z",
    "Title": "Build hybrid apps with .NET MAUI",
    "Speaker": "Beth Massi, Eilon Lipton",
    "Description": "In this session learn why you would choose a hybrid web approach to building native apps with .NET MAUI in .NET 9. Learn about Blazor hybrid and how you can build full-featured native apps for Windows, Mac, iOS and Android within a single codebase that can take advantage of your web skills. Take a tour of the new Blazor hybrid tools and templates in .NET 9 and see how you can reuse UI to build solutions that target the web at the same time. We'll also take a look at the new HybridWebView control and show how you can leverage other web frameworks in .NET MAUI."
  },
  {
    "SessionId": 12,
    "BeginDateTime": "2024-11-12T15:45:00-08:00",
    "EndDateTime": "2024-11-12T16:15:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T07:45:00Z",
    "EndDateTimeInCST": "2024-11-13T08:15:00Z",
    "Title": "What's new in Visual Studio 2022 for .NET developers",
    "Speaker": "Simona Liao, Junyu Wang",
    "Description": "Introducing exciting new features in Visual Studio 2022 for .NET developers with demos"
  },
  {
    "SessionId": 13,
    "BeginDateTime": "2024-11-12T16:15:00-08:00",
    "EndDateTime": "2024-11-12T16:45:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T08:15:00Z",
    "EndDateTimeInCST": "2024-11-13T08:45:00Z",
    "Title": "Discover the Latest GitHub Copilot Features for .NET Developers in Visual Studio",
    "Speaker": "Rhea Patel",
    "Description": "Since its launch in 2021, GitHub Copilot has transformed the way developers write code by leveraging AI to enhance coding efficiency. Powered by advanced models from GitHub, OpenAI, and Microsoft, Copilot has continued to evolve. With the latest updates in Visual Studio, .NET developers have even more powerful tools at their disposal."
  },
  {
    "SessionId": 14,
    "BeginDateTime": "2024-11-12T16:45:00-08:00",
    "EndDateTime": "2024-11-12T17:45:00-08:00",
    "BeginDateTimeInCST": "2024-11-13T08:45:00Z",
    "EndDateTimeInCST": "2024-11-13T09:45:00Z",
    "Title": "CodeParty Attendee Party",
    "Speaker": "Jeffrey T. Fritz",
    "Description": "Join Jeff Fritz, Dee Dee Walsh, Sara Faatz and more special guests for our attendee party for some fun and prizes to be given away from our sponsors."
  },
  {
    "SessionId": 15,
    "BeginDateTime": "2024-11-13T09:00:00-08:00",
    "EndDateTime": "2024-11-13T10:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T01:00:00Z",
    "EndDateTimeInCST": "2024-11-14T02:00:00Z",
    "Title": "Building and scaling cloud-native, intelligent applications on Azure and .NET",
    "Speaker": "Scott Hunter, Paul Yuknewicz",
    "Description": "Learn how to run cloud-native serverless and container applications in Azure using Azure Kubernetes Service and Azure Container Apps. We help you choose the right service for your apps. We show you how Azure is the best platform for hosting cloud native and intelligent apps, and an app using Azure OpenAI Service and Azure Data. Learn all the new capabilities of our container platforms including how to deploy, test for scale, monitor, and much more."
  },
  {
    "SessionId": 16,
    "BeginDateTime": "2024-11-13T10:00:00-08:00",
    "EndDateTime": "2024-11-13T10:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T02:00:00Z",
    "EndDateTimeInCST": "2024-11-14T02:30:00Z",
    "Title": "Building and deploying an Azure Functions app with .NET Aspire in 25 minutes",
    "Speaker": "Safia Abdalla, Matthew Henderson",
    "Description": "Azure Functions is an event-driven serverless platform that makes it easy to build scalable and low-maintenance services in the cloud. .NET Aspire is .NET's modern framework for developing modern applications with a great developer loop. What happens you bring the two together? Pure magic! In this session, we'll go from zero to hero and build a .NET Aspire-enabled Azure Functions application together then deploy it to the cloud. Along the way, we'll learn about the new features in .NET Aspire and Azure Functions that make the development and deployment experience a total breeze."
  },
  {
    "SessionId": 17,
    "BeginDateTime": "2024-11-13T10:30:00-08:00",
    "EndDateTime": "2024-11-13T11:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T02:30:00Z",
    "EndDateTimeInCST": "2024-11-14T03:00:00Z",
    "Title": ".NET Aspire Roadmap, Vision, and Beyond",
    "Speaker": "David Fowler",
    "Description": ".NET Aspire is a powerful collection of tools and packages that help you develop cloud apps without all the confusion and overhead that comes with it. .NET Aspire shipped in May, and just had it's first major release since! Join David Fowler for a deep dive into the vision for Aspire and a look at the roadmap for the next few releases."
  },
  {
    "SessionId": 18,
    "BeginDateTime": "2024-11-13T11:00:00-08:00",
    "EndDateTime": "2024-11-13T11:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T03:00:00Z",
    "EndDateTimeInCST": "2024-11-14T03:30:00Z",
    "Title": "Introducing HybridCache in ASP.NET Core",
    "Speaker": "Marc Gravell",
    "Description": ""
  },
  {
    "SessionId": 19,
    "BeginDateTime": "2024-11-13T11:30:00-08:00",
    "EndDateTime": "2024-11-13T12:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T03:30:00Z",
    "EndDateTimeInCST": "2024-11-14T04:00:00Z",
    "Title": "Centrally managing your .NET APIs with Azure API Center",
    "Speaker": "Julia Kasper, Martyn Coupland",
    "Description": "In today’s rapidly evolving digital landscape, managing and governing APIs effectively is crucial for organizational success. Join us for an insightful session tailored specifically for .NET developers, where we will explore the latest features and best practices for leveraging Azure API Center to its fullest potential.\r\n\r\nDiscover how Azure API Center enables you to centralize your API inventory, ensuring seamless discovery, tracking, and governance across your organization. Learn how to develop and maintain a structured and organized inventory of your APIs, regardless of their type, lifecycle stage, or deployment location."
  },
  {
    "SessionId": 20,
    "BeginDateTime": "2024-11-13T12:00:00-08:00",
    "EndDateTime": "2024-11-13T12:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T04:00:00Z",
    "EndDateTimeInCST": "2024-11-14T04:30:00Z",
    "Title": "What's new in C# Dev Kit for VS Code",
    "Speaker": "Wendy Breiding (She/Her), Leslie Richardson",
    "Description": "Love VS Code? Working on Mac, Windows, or Linux? We'll show you how to get the most out of C# Dev Kit to be the most productive doing C# development in VS Code."
  },
  {
    "SessionId": 21,
    "BeginDateTime": "2024-11-13T12:30:00-08:00",
    "EndDateTime": "2024-11-13T13:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T04:30:00Z",
    "EndDateTimeInCST": "2024-11-14T05:00:00Z",
    "Title": "C#'s Best features you might not be using",
    "Speaker": "Bill Wagner",
    "Description": "Take a look at some great C# features that can make your code more resilient and easier to understand. This talk will help you improve the code your team writes right away because all of these features are available in C# 12, with many available in lower versions. You'll leave knowing not only what makes better code but why."
  },
  {
    "SessionId": 22,
    "BeginDateTime": "2024-11-13T13:00:00-08:00",
    "EndDateTime": "2024-11-13T13:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T05:00:00Z",
    "EndDateTimeInCST": "2024-11-14T05:30:00Z",
    "Title": "openai-dotnet: the official OpenAI library for .NET",
    "Speaker": "Angelos Petropoulos",
    "Description": "Join us for an in-depth exploration of openai-dotnet, the .NET client library for OpenAI. In this session, we'll walk you through the key features and capabilities of the library, demonstrate how to integrate it into your .NET applications, and showcase real-world examples. Whether you're a seasoned developer or new to AI, you'll leave with the knowledge and tools to harness the power of OpenAI in your .NET projects. Don't miss this opportunity to get ahead of the curve and start building intelligent applications today!"
  },
  {
    "SessionId": 23,
    "BeginDateTime": "2024-11-13T13:30:00-08:00",
    "EndDateTime": "2024-11-13T14:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T05:30:00Z",
    "EndDateTimeInCST": "2024-11-14T06:00:00Z",
    "Title": "Building the Foundation: AI Fundamentals in .NET",
    "Speaker": "Luis Quintanilla, Tanner Gooding, Tarek Sayed",
    "Description": "In this presentation, we will explore the core principles and foundational elements of Artificial Intelligence (AI) within the .NET ecosystem. This session will delve into the essential AI building blocks, including Tensors and Tokenizers, and demonstrate how these components are integrated and optimized within .NET. We will also highlight how these AI fundamentals build on top of existing investments in the .NET ecosystem, such as Span and Generic Math, to enhance performance and efficiency. Attendees will gain insights into the investments being made at the lower levels of the stack to ensure robust and efficient AI applications. Join us to discover how .NET is empowering developers to build intelligent solutions from the ground up, laying a strong foundation for future innovations."
  },
  {
    "SessionId": 24,
    "BeginDateTime": "2024-11-13T14:00:00-08:00",
    "EndDateTime": "2024-11-13T14:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T06:00:00Z",
    "EndDateTimeInCST": "2024-11-14T06:30:00Z",
    "Title": "Navigating the world of AI Models in .NET",
    "Speaker": "Jordan Matthiesen",
    "Description": "As the field of artificial intelligence continues to grow and evolve, the number of available AI models is rapidly expanding. With models like Phi, Mistral, and many others, concepts like small local models and foundational models,  it can be overwhelming to navigate this complex landscape. This talk will explore how frameworks like Semantic Kernel and tools like Ollama make it easy to work with these models inside your .NET applications. Learn how to harness the power of the latest AI models to build intelligent, cutting-edge applications with ease. Join us on quick dive into the world of .NET and AI models!"
  },
  {
    "SessionId": 25,
    "BeginDateTime": "2024-11-13T14:30:00-08:00",
    "EndDateTime": "2024-11-13T15:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T06:30:00Z",
    "EndDateTimeInCST": "2024-11-14T07:00:00Z",
    "Title": ".NET MAUI Performance Optimizations with NativeAOT and Trimming",
    "Speaker": "Jonathan Peppers",
    "Description": "Jon will walk through the latest features in .NET 9 to make your iOS and Android apps smaller and faster. Can you use System.Reflection? It depends! Jon will walk through the details in making your code NativeAOT and fully-trim compatible, showing the improvements to app size and startup time. This session will also be useful for NuGet package authors that want to ship libraries that can be fully optimized for mobile or self-contained deployments."
  },
  {
    "SessionId": 26,
    "BeginDateTime": "2024-11-13T15:00:00-08:00",
    "EndDateTime": "2024-11-13T15:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T07:00:00Z",
    "EndDateTimeInCST": "2024-11-14T07:30:00Z",
    "Title": "What's new in WinUI and Windows App SDK 1.6",
    "Speaker": "Michael Hawker, Michael Jolley",
    "Description": "Companies are building apps used by millions of users on Windows Desktop with WinUI and Windows App SDK. Are you missing out? Come here and find out! This session will cover the latest features released in WinUI and the Windows App SDK, its integration with .NET and Native AOT, how you can get started using these technologies in your Win32 applications, and a look ahead!"
  },
  {
    "SessionId": 27,
    "BeginDateTime": "2024-11-13T15:30:00-08:00",
    "EndDateTime": "2024-11-13T16:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T07:30:00Z",
    "EndDateTimeInCST": "2024-11-14T08:00:00Z",
    "Title": "Easily Improve Web Application Performance using .NET 9 Caching and Redis",
    "Speaker": "Catherine Wang, Matt Soucoup",
    "Description": "Does your web application experience performance bottlenecks caused by repeated data queries? Does it feel annoying having to write so much boilerplate code to use Redis for caching? We are introducing the .NET 9 Hybrid Cache interface that simplifies caching with Redis down to a single line of code! Furthermore, you can simply extend your existing application to become intelligent with Redis being a vector datastore and semantic cache, while preserving all the performance benefits. Samples and demos will be provided to showcase the Redis capabilities and best practices."
  },
  {
    "SessionId": 28,
    "BeginDateTime": "2024-11-13T16:00:00-08:00",
    "EndDateTime": "2024-11-13T16:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T08:00:00Z",
    "EndDateTimeInCST": "2024-11-14T08:30:00Z",
    "Title": "Modern WinForms Development with .NET 9",
    "Speaker": "Merrie McGaw, Klaus Loeffelman",
    "Description": "Join us as we look at the new features coming your way in WinForms for .NET 9. Check out some awesome ideas for incorporating Copilot into your applications as well as modern UI updates."
  },
  {
    "SessionId": 29,
    "BeginDateTime": "2024-11-13T16:30:00-08:00",
    "EndDateTime": "2024-11-13T17:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T08:30:00Z",
    "EndDateTimeInCST": "2024-11-14T09:00:00Z",
    "Title": "Build your own .NET Aspire integrations",
    "Speaker": "Aaron Powell, David Pine",
    "Description": "One of the core parts of .NET Aspire is the ability to add integrations into your app host or project code to streamline your resource setup and development. The .NET Aspire team has built a bunch of integrations, but if there's something else you need, you can build it yourself! Join some folks from the .NET Aspire team to learn how integrations work, how to build one, and how you could even contribute to the new .NET Aspire Community Toolkit."
  },
  {
    "SessionId": 30,
    "BeginDateTime": "2024-11-13T17:00:00-08:00",
    "EndDateTime": "2024-11-13T17:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T09:00:00Z",
    "EndDateTimeInCST": "2024-11-14T09:30:00Z",
    "Title": "Build Your First GitHub Copilot Extension",
    "Speaker": "Brian Randell",
    "Description": "Unlock the potential of GitHub Copilot by learning how to build an extension for yourself or your organization. Whether you're new to GitHub Copilot or an experienced developer looking to customize your coding assistant, this session is designed to guide you through the process of quickly creating an extension for yourself or your organization.\r\n\r\nIn just 30 minutes, Brian will share the key concepts behind GitHub Copilot extensibility, explore real-world use cases, and help you walk away with the knowledge to build, test, and deploy your first extension using C# and ASP.NET Core. You’ll see how to use Visual Studio 2022 to build & debug your extension from nothing to something.\r\n\r\nPerfect for developers of all levels, this session will include:\r\n•\tAn introduction to GitHub Copilot extensibility\r\n•\tA live demo of building a simple extension\r\n•\tTips and best practices for customizing GitHub Copilot to enhance productivity\r\n\r\nDon’t miss this opportunity to get a head start in making GitHub Copilot work for you!"
  },
  {
    "SessionId": 31,
    "BeginDateTime": "2024-11-13T17:30:00-08:00",
    "EndDateTime": "2024-11-13T18:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T09:30:00Z",
    "EndDateTimeInCST": "2024-11-14T10:00:00Z",
    "Title": "Using Blazor to manage data in SQL server and Microsoft Fabric",
    "Speaker": "Michael Washington",
    "Description": "Many business applications need to allow their users to view and update data in SQL server and data warehouses such as Microsoft Fabric. Learn how to create custom applications using Microsoft Blazor and free open-source controls such as Blazor Data Sheet to rapidly implement solutions to your users. Learn how to implement row level security to control access to the data in a granular way. Finally learn how to use PowerBI embedded to provide advanced data analytics."
  },
  {
    "SessionId": 32,
    "BeginDateTime": "2024-11-13T18:00:00-08:00",
    "EndDateTime": "2024-11-13T18:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T10:00:00Z",
    "EndDateTimeInCST": "2024-11-14T10:30:00Z",
    "Title": "From Figma to .NET MAUI: Transform Your Designs into XAML Code in Seconds",
    "Speaker": "Héctor Uriel Pérez Rojas",
    "Description": "In this session, I will share my journey in developing a tool called Xamlify, which allows me to convert Figma designs into XAML code in .NET MAUI in just a few seconds, enabling me to reduce the time spent on creating graphical interfaces by 80% to 90%. I achieved this using Blazor, a lot of C# code, and Azure OpenAI."
  },
  {
    "SessionId": 33,
    "BeginDateTime": "2024-11-13T18:30:00-08:00",
    "EndDateTime": "2024-11-13T19:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T10:30:00Z",
    "EndDateTimeInCST": "2024-11-14T11:00:00Z",
    "Title": "Master Visual Studio Debugging: Tips, Tricks, and AI Insights!",
    "Speaker": "Harshada Hole",
    "Description": "Join us for an engaging session that combines essential Visual Studio debugging techniques with the power of Co-Pilot's AI assistance.\r\n\r\nLearn how to debug more efficiently, from breakpoints to watch windows, and discover how Co-Pilot can optimize your workflow with intelligent, context-aware suggestions tailored to your coding style. \r\n\r\n Elevate your debugging skills and fully leverage the capabilities of Visual Studio in this concise and insightful session."
  },
  {
    "SessionId": 34,
    "BeginDateTime": "2024-11-13T19:00:00-08:00",
    "EndDateTime": "2024-11-13T19:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T11:00:00Z",
    "EndDateTimeInCST": "2024-11-14T11:30:00Z",
    "Title": "Testing.Platform, the new way to run .NET tests",
    "Speaker": "Jakub Jares",
    "Description": "Testing platform is a new way to run .NET tests that we developed at Microsoft as an alternative to VSTest. This new platform is lightweight, modular, and distributed completely as nuget packages. It builds test projects into executables, is easy to extend and can run almost anywhere.\r\n\r\nIn this talk I will show you what Testing platform is, how to use it to run tests using popular testing frameworks MSTest, NUnit and XUnit.\r\n\r\nI will also show what are the benefits of this new testing platform over VSTest, and how to use them to your advantage. Such as portability, self-contained tests, running tests with Native AOT and so on.\r\n\r\nYou will learn about our design process, the pillars of our new testing platform and the improvements it allowed us to do in MSTest."
  },
  {
    "SessionId": 35,
    "BeginDateTime": "2024-11-13T19:30:00-08:00",
    "EndDateTime": "2024-11-13T20:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T11:30:00Z",
    "EndDateTimeInCST": "2024-11-14T12:00:00Z",
    "Title": "Running .NET Aspire on a local Kubernetes cluster",
    "Speaker": "Jorge Arteiro",
    "Description": "On this video, we are going to leverage all the power of .NET aspire and Kubernetes. Using Aspirate CLI, Kubernetes local cluster with Kind and Docker Desktop. We are going to deep dive into Kubernetes manifests and Helm charts. How about Debugging? we are going to use Mirrord open-source project to show you how debug your applications running on Kubernetes."
  },
  {
    "SessionId": 36,
    "BeginDateTime": "2024-11-13T20:00:00-08:00",
    "EndDateTime": "2024-11-13T20:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T12:00:00Z",
    "EndDateTimeInCST": "2024-11-14T12:30:00Z",
    "Title": "Spotify knows how you're feeling today ... via Semantic Kernel",
    "Speaker": "Justin Yoo",
    "Description": "You know your current mood, and you want to create a playlist on Spotify based on your current mood. But how does it catch how you're feeling now?\r\n\r\nThroughout this session, I'm going to discuss how Semantic Kernel seamlessly integrates OpenAI with existing codebase, and as a result, it will create a playlist based on the Billboard Top 100 chart, reflecting your current sentiment."
  },
  {
    "SessionId": 37,
    "BeginDateTime": "2024-11-13T20:30:00-08:00",
    "EndDateTime": "2024-11-13T21:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T12:30:00Z",
    "EndDateTimeInCST": "2024-11-14T13:00:00Z",
    "Title": "Embedding Python libraries in .NET services and applications",
    "Speaker": "Anthony Shaw, Aaron Powell",
    "Description": "In this session we will bridge the gap between two powerful realms of development: .NET and Python. Discover the seamless integration of Python into .NET APIs and Services through an innovative new project that promises to revolutionize your workflow. We'll showcase a live demonstration of embedding essential AI and ML libraries such as scikit-learn and NumPy into a .NET Aspire application, revealing the untapped potential of end-to-end tracing for Enterprise development. This session is not just about observing; it's about engaging. We're eager to gather feedback, delve into diverse use cases, and share success stories from the community. Whether you're a seasoned developer or just starting, this is the perfect opportunity to expand your toolkit."
  },
  {
    "SessionId": 38,
    "BeginDateTime": "2024-11-13T21:00:00-08:00",
    "EndDateTime": "2024-11-13T21:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T13:00:00Z",
    "EndDateTimeInCST": "2024-11-14T13:30:00Z",
    "Title": "Use .NET Aspire to create Generative AI Cloud Native Solutions",
    "Speaker": "Kinfey Lo",
    "Description": ".NET Aspire is a one-stop cloud-native distributed application solution. In this session, in the Generative AI scenario, you will use .NET Aspire combined with the Phi-3-mini ONNX model to quickly build RAG applications. You will learn\r\n \r\n1. How .NET Aspire structures GenAI applications\r\n2. Semantic Kernel creation skills\r\n3. Create RAG application through Phi-3-mini"
  },
  {
    "SessionId": 39,
    "BeginDateTime": "2024-11-13T21:30:00-08:00",
    "EndDateTime": "2024-11-13T22:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T13:30:00Z",
    "EndDateTimeInCST": "2024-11-14T14:00:00Z",
    "Title": "Modernising Legacy .NET Codebases with NDepend",
    "Speaker": "Goh Chun Lin",
    "Description": "In this talk, we will explore how to migrate legacy .NET projects, such as O2DES.NET, which are still targeting at .NET Standard 2.1 to modern frameworks, focusing on the importance of code quality and maintainability. \r\n\r\nIn 2019, I had the honour of working closely with the team behind the open-source O2DES.NET during my time working at the C4NGP research center in National University of Singapore. After I left the team in 2022, O2DES.NET has not been actively updated on their GitHub public repository and it is still targeting at .NET Standard 2.1.\r\n\r\nThrough the example of updating O2DES.NET, we will demonstrate how static analysis tools like NDepend can help assess technical debt, visualise code dependencies, and guide us on code refactoring with the coding rules. \r\n\r\nWhether you are preparing for .NET 9 or optimising for current .NET versions, you will gain insights on how to future-proof your code for upcoming platform updates."
  },
  {
    "SessionId": 40,
    "BeginDateTime": "2024-11-13T22:00:00-08:00",
    "EndDateTime": "2024-11-13T22:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T14:00:00Z",
    "EndDateTimeInCST": "2024-11-14T14:30:00Z",
    "Title": "Navigating Async Challenges in EF Core for Large Data Retrieval",
    "Speaker": "Saeed Esmaeelinejad",
    "Description": "This talk will address a common yet critical issue faced by developers using EF Core (including EF Core 9.0) to read large datasets asynchronously. Despite the promise of scalability with async programming, many encounter performance degradation, timeouts, or incomplete data reads when using methods like ToListAsync and FirstOrDefaultAsync in EF Core.\r\n\r\nWe'll examine the underlying SqlClient library and its internal class, TdsParserStateObject, to understand how it handles asynchronous operations and why it struggles with large data reads. Attendees will gain insights into EF Core's async behavior, potential workarounds, and strategies to optimize performance when working with large datasets."
  },
  {
    "SessionId": 41,
    "BeginDateTime": "2024-11-13T22:30:00-08:00",
    "EndDateTime": "2024-11-13T23:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T14:30:00Z",
    "EndDateTimeInCST": "2024-11-14T15:00:00Z",
    "Title": "With .NET and AI, our community app \"aspires\" to be on cloud nine",
    "Speaker": "Augustine Correa",
    "Description": "We are the largest Open-Source Software [OSS] community with its longest running (> 10 years) tech meetup in Bombay.\r\n\r\nAnd as such we are mostly houseful [\r\nhttps://x.com/search?q=learnAspireMumbai&src=typed_query&f=live]. As a community that is committed to diversity and inclusiveness, most of our efforts and time is expended on registration triaging. And the next biggest friction in our meetup management is to ensure attendee check-ins and check-outs for building/civic code adherence\r\n\r\nSo as a tech community, to solve this, we did the only thing we love to do: build an app. That too on .NET 9. We will tell you why .net9 is the best .NET yet and share what are the gotchas we had to look out for.\r\n\r\nIn this session, we will explore the development of our community app using the latest features of .NET 9: Aspire, Semantic Kernel, Blazor Hybrid. This app leverages the power of .NET 9 to create a cloud-native, and intelligent platform that enhances user engagement and community interaction. We will delve into the integration of AI models to provide personalized experiences and improve overall functionality to building an inclusive and diverse community\r\n\r\nAlso, our demo would include how GitHub Copilot and Copilot Workspace turbo charged our development to debut the app in time for .NET Conf 2024.\r\n \r\nAnd we wouldn't be an OSS community, if it's not on GitHub [https://github.com/HackerspaceMumbai/Visage/tree/dotnet9]. Contributors welcome 🙏"
  },
  {
    "SessionId": 42,
    "BeginDateTime": "2024-11-13T23:00:00-08:00",
    "EndDateTime": "2024-11-13T23:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T15:00:00Z",
    "EndDateTimeInCST": "2024-11-14T15:30:00Z",
    "Title": "Building Modular Monolith Applications with ASP.NET Core and ABP Studio",
    "Speaker": "Halil İbrahim Kalkan",
    "Description": "ABP is an open source application development framework for .NET Developers. One of its main goals is to enable you to create modular applications. With the new ABP Studio tool, it is now easier to create fully modular systems with ASP.NET Core.\r\nIn this talk, I will show how to do it in practical and explain the benefits of that approach."
  },
  {
    "SessionId": 43,
    "BeginDateTime": "2024-11-13T23:30:00-08:00",
    "EndDateTime": "2024-11-14T00:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T15:30:00Z",
    "EndDateTimeInCST": "2024-11-14T16:00:00Z",
    "Title": "From error to fixes:Adding recoverability to MassTransit - based systems",
    "Speaker": "Irina Dominte(Scurtu)",
    "Description": "In distributed systems, failures and errors are inevitable. Often, even after several automatic retries, messages can't be processed and end up in error queues. What then?\r\n\r\nYou will require some message broker knowledge to reprocess them, and manually extract them from the queues, but these are some reasons you use an abstraction like MassTransit. To not need that.\r\n\r\nThis session uses Aspire and ServiceControl to provide a practical approach to seamlessly adding *replayability* to MassTransit-based systems."
  },
  {
    "SessionId": 44,
    "BeginDateTime": "2024-11-14T00:00:00-08:00",
    "EndDateTime": "2024-11-14T00:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T16:00:00Z",
    "EndDateTimeInCST": "2024-11-14T16:30:00Z",
    "Title": "Releasing HybridCache into the Wild with Umbraco",
    "Speaker": "Emma Burstow, Lotte Pitcher",
    "Description": "In November 2024, Microsoft will unveil the highly anticipated hybrid cache feature, and at Umbraco, we couldn't be more excited. Our close alignment with Microsoft’s release cadence allows us to strategically incorporate the latest MS roadmap features such as tag-based eviction and the new MapStaticAssets middleware into our sprint planning. We’d like to show that on this occasion, the hybrid cache and other features have provided us with a unique opportunity to innovate.\r\n\r\nJoin Emma and Lotte as they take you through Umbraco’s development in sync with Microsoft’s vision. They will showcase how our approach has enabled us to swiftly integrate cutting-edge capabilities, culminating in the implementation of the latest features in .NET 9. Discover how Umbraco’s agile alignment with Microsoft’s evolving technology landscape drives forward-thinking solutions that keep us ahead of the curve."
  },
  {
    "SessionId": 45,
    "BeginDateTime": "2024-11-14T00:30:00-08:00",
    "EndDateTime": "2024-11-14T01:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T16:30:00Z",
    "EndDateTimeInCST": "2024-11-14T17:00:00Z",
    "Title": "F# - Nullable Reference Types",
    "Speaker": "Tomáš Grošup",
    "Description": "Join us for an in-depth exploration of F# 9's highly anticipated Nullable Reference Types feature. After years of development and strong community demand, this feature is set to revolutionize how F# handles null values, making C#-F# interop smoother and bringing a new level of null safety to the language. \r\n\r\nWhether you're an F# enthusiast or a C# developer looking to leverage F#'s strengths, this talk will equip you with the knowledge to take full advantage of this new feature."
  },
  {
    "SessionId": 46,
    "BeginDateTime": "2024-11-14T01:00:00-08:00",
    "EndDateTime": "2024-11-14T01:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T17:00:00Z",
    "EndDateTimeInCST": "2024-11-14T17:30:00Z",
    "Title": "C# Source Generators Boost Productivity in the Rx.NET Repo",
    "Speaker": "Ian Griffiths",
    "Description": "Code generation has become increasingly important in recent versions of .NET, especially when using AOT compilation. But they can also play a role in boosting your power as a developer.\r\n\r\nThis talk will show how we've been using source generators to extend the reach of the test suite in the Reactive Extensions for .NET. AsyncRx.NET was an experimental project with no tests, but source generators have made it possible to make the existing Rx.NET test suite work in this new project."
  },
  {
    "SessionId": 47,
    "BeginDateTime": "2024-11-14T01:30:00-08:00",
    "EndDateTime": "2024-11-14T02:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T17:30:00Z",
    "EndDateTimeInCST": "2024-11-14T18:00:00Z",
    "Title": "Advanced Pattern Matching in C#",
    "Speaker": "Oliver Sturm",
    "Description": "All \"real\" functional languages support Pattern Matching - that's not really true, but it is correct that aspects of a functional programming style benefit from elegant and syntactically compact case distinction. Microsoft worked on Pattern Matching as a C# feature in at least three major language versions! In this talk, Oliver demonstrates how C# Pattern Matching works, why this evolution of the old imperative \"switch\" is so important, and how the structure of C# Code can be generally different from the past on the basis of this feature. As a conclusion, he proves that C# can now pattern match with the best, by porting a complex piece of Haskell code."
  },
  {
    "SessionId": 48,
    "BeginDateTime": "2024-11-14T02:00:00-08:00",
    "EndDateTime": "2024-11-14T02:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T18:00:00Z",
    "EndDateTimeInCST": "2024-11-14T18:30:00Z",
    "Title": "Bulletproof ASP.NET Core APIs: The OWASP API Security Top Ten",
    "Speaker": "Christian Wenz",
    "Description": "The OWASP Top Ten as a list of the ten biggest security risks for web applications has been a de facto standard for over ten years. Somewhat out of the limelight, however, there are other lists. The OWASP API Security Top Ten highlights risks for APIs. Since arguably almost every web application relies on APIs these days, it's imperative that we address them. In the talk, we'll take a look at how the list came about and then go through all the points. In particular, we are of course interested in what this means for our chosen stack ASP.NET Core. Which points are relevant, and how can we take technology-specific countermeasures?"
  },
  {
    "SessionId": 49,
    "BeginDateTime": "2024-11-14T02:30:00-08:00",
    "EndDateTime": "2024-11-14T03:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T18:30:00Z",
    "EndDateTimeInCST": "2024-11-14T19:00:00Z",
    "Title": "Accessibility as a concept",
    "Speaker": "Jemima Abu",
    "Description": "Knowing how to build accessible products is important but it's just as important to know why we build products to be accessible. Basic human decency aside, there's a plethora of reasons for building products that everyone can use. In this talk, we'll explore the concept of accessibility in order to better understand its necessity and the ramifications involved in building non accessible products. We'll also answer pressing questions like \"How do I know if this thing I built is accessible?\" and \"Whose job is it to ensure accessibility?\" (Spoiler: it's everyone's job)"
  },
  {
    "SessionId": 50,
    "BeginDateTime": "2024-11-14T03:00:00-08:00",
    "EndDateTime": "2024-11-14T03:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T19:00:00Z",
    "EndDateTimeInCST": "2024-11-14T19:30:00Z",
    "Title": "Building Rich Web Applications with Blazor Server and MudBlazor",
    "Speaker": "Flora Mousavi",
    "Description": "In this session, we'll explore how to create robust, interactive web applications using Blazor Server and MudBlazor. We'll dive into practical examples from a real-world application, discussing how MudBlazor's rich components can enhance user experience and simplify development. The session will cover performance optimization techniques, handling complex UI requirements, and best practices for deploying Blazor Server apps in production. Attendees will leave with actionable insights to elevate their Blazor Server projects."
  },
  {
    "SessionId": 51,
    "BeginDateTime": "2024-11-14T03:30:00-08:00",
    "EndDateTime": "2024-11-14T04:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T19:30:00Z",
    "EndDateTimeInCST": "2024-11-14T20:00:00Z",
    "Title": "Building Generative AI apps with GitHub Models and .NET",
    "Speaker": "April Yoho",
    "Description": "As a full stack engineer, we often are integrating our code with various AI models. As access to models has been a challenge, you can now customize and are given a free playground with GitHub Models.\r\n\r\nIn this session we'll dive into how to choose an AI model, configure the parameters and most importantly learn about prompting with AI. April will be providing a hands-on session to being AI to your engineering practices"
  },
  {
    "SessionId": 52,
    "BeginDateTime": "2024-11-14T04:00:00-08:00",
    "EndDateTime": "2024-11-14T04:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T20:00:00Z",
    "EndDateTimeInCST": "2024-11-14T20:30:00Z",
    "Title": "Empowering WPF Developers: A Journey Through .NET 9 and the Road Ahead",
    "Speaker": "Pankaj Chaurasia",
    "Description": "Join us on a journey through the latest advancements in WPF with .NET 9 and explore the exciting future that lies ahead. This talk will dive deep into the new Fluent theme, which brings a modern Windows 11 look and feel to WPF applications, complete with Light/Dark mode and system accent color support. We'll also cover the new hyphen-based ligature support that enhances typography for a more polished user experience. But that's not all—get a sneak peek into what's planned for beyond .NET 10, including the top-requested features that will empower you to build even more powerful and visually stunning WPF applications. Whether you're a seasoned WPF developer or just getting started, this session will equip you with the knowledge and tools to take full advantage of the platform's evolving capabilities."
  },
  {
    "SessionId": 53,
    "BeginDateTime": "2024-11-14T04:30:00-08:00",
    "EndDateTime": "2024-11-14T05:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T20:30:00Z",
    "EndDateTimeInCST": "2024-11-14T21:00:00Z",
    "Title": "WPF Reborn: Avalonia's Cross-Platform Magic",
    "Speaker": "Mike James",
    "Description": "Step into the future of .NET app development! \r\n\r\nThis hands-on session will revolutionise the way you think about WPF applications. We're ditching the slides and diving straight into the IDE to show you how Avalonia and Avalonia XPF can breathe new life into your Windows-only apps.\r\n\r\nYou'll leave with the knowledge to take your desktop apps cross-platform, opening up new markets and opportunities."
  },
  {
    "SessionId": 54,
    "BeginDateTime": "2024-11-14T05:00:00-08:00",
    "EndDateTime": "2024-11-14T05:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T21:00:00Z",
    "EndDateTimeInCST": "2024-11-14T21:30:00Z",
    "Title": "Talking to managers about modernizing .NET apps",
    "Speaker": "Tomas Herceg",
    "Description": "Most developers understand the benefits of migrating legacy apps to the new .NET and the risks of not doing so. Sadly, it is usually not the developers who decide whether these old .NET Framework applications will be modernized or not. \r\nHow do you convince the management to allocate the budget for this task? What arguments and information should you present to stakeholders who do not have a technical background to ensure they understand the situation?\r\nIn this session, I'll provide valuable tips and arguments I used in the past to advocate the necessity of modernization in various companies. I'll talk about estimating the effort of modernization and the long-term maintenance costs. I'll also go through the security risks and other benefits of the upgrade, such as improving the project's attractiveness for hiring new developers."
  },
  {
    "SessionId": 55,
    "BeginDateTime": "2024-11-14T05:30:00-08:00",
    "EndDateTime": "2024-11-14T06:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T21:30:00Z",
    "EndDateTimeInCST": "2024-11-14T22:00:00Z",
    "Title": "Azure Health Checks in .NET 9",
    "Speaker": "Steven Hook",
    "Description": "Join us for an exploration of how Azure’s Health Check feature, integrated with .NET 9 APIs, can provide base-level or even customized validation of your application’s health. We'll also be covering some lessons learned from production systems and some surprising results of misconfigured health checks. At first glace, health checks are rather simple but determining what to check and what Azure does with applications that fail those checks is critical to understand before implementing a health check.\r\n\r\nTopics to cover:\r\n- Setting up a simple health check to ensure the app service exists\r\n- Customizing your health check to validate dependencies\r\n- Discussing some secrets of how Azure recovers from an unhealth app\r\n- Advanced customizations to have more control of failovers and frequency"
  },
  {
    "SessionId": 56,
    "BeginDateTime": "2024-11-14T06:00:00-08:00",
    "EndDateTime": "2024-11-14T06:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T22:00:00Z",
    "EndDateTimeInCST": "2024-11-14T22:30:00Z",
    "Title": "Migrate your .NET Framework / EF6 \"Classic\" app to .NET 9 and Azure SQL",
    "Speaker": "Erik Ejlskov Jensen",
    "Description": "With the help of a new Entity Framework 6 \"Classic\" package thjat I have just published, you can migrate your legacy .NET Framework applications in increments and move to .NET 9 with Azure SQL Database and the latest security advances. In this demo driven session you will learn how to do this with the help of .NET Upgrade Assistant and my new package."
  },
  {
    "SessionId": 57,
    "BeginDateTime": "2024-11-14T06:30:00-08:00",
    "EndDateTime": "2024-11-14T07:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T22:30:00Z",
    "EndDateTimeInCST": "2024-11-14T23:00:00Z",
    "Title": "dotnet CLI all the things!",
    "Speaker": "Andres Pineda",
    "Description": "Visual Studio is undoubtedly an excellent IDE that makes us highly productive in building applications, offering the best experience for .NET development. But what if you could remain productive even when Visual Studio isn't available?\r\n\r\nIn this presentation, we'll dive into the capabilities of the .NET CLI, equipping you with everything you need to build, run, and deploy all types of .NET applications."
  },
  {
    "SessionId": 58,
    "BeginDateTime": "2024-11-14T07:00:00-08:00",
    "EndDateTime": "2024-11-14T07:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T23:00:00Z",
    "EndDateTimeInCST": "2024-11-14T23:30:00Z",
    "Title": "From Monolith Towards Microservices: EventStorming as Your Modernization Blueprint",
    "Speaker": "Sarah Dutkiewicz",
    "Description": "Modernizing legacy monoliths is a daunting task, but EventStorming offers a clear path forward. Join us as we show how you can use EventStorming to deconstruct your monolithic .NET applications and migrate them towards a microservices architecture. This session will provide actionable insights into the EventStorming process, highlighting how it helps align technical and business teams while reducing risks and ensuring a smooth transition."
  },
  {
    "SessionId": 59,
    "BeginDateTime": "2024-11-14T07:30:00-08:00",
    "EndDateTime": "2024-11-14T08:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-14T23:30:00Z",
    "EndDateTimeInCST": "2024-11-15T00:00:00Z",
    "Title": "Building Microservices with .NET 9: Integrating AI for Smarter, Scalable Applications",
    "Speaker": "Rebai Hamida",
    "Description": "As microservices continue to dominate the architecture landscape, integrating AI capabilities into these services can lead to smarter and more responsive applications. In this session, we'll explore:\r\nHow to architect microservices with .NET 9, focusing on modularity, scalability, and maintainability.\r\nThe process of embedding AI into these microservices using Azure OpenAI, enhancing their functionality with intelligent decision-making.\r\nStrategies for deploying and managing these AI-powered microservices in a containerized environment using Docker, ensuring they are cloud-ready."
  },
  {
    "SessionId": 60,
    "BeginDateTime": "2024-11-14T08:00:00-08:00",
    "EndDateTime": "2024-11-14T08:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T00:00:00Z",
    "EndDateTimeInCST": "2024-11-15T00:30:00Z",
    "Title": "How I used .NET 9 and AI to charge my electric car based on the available solar power",
    "Speaker": "Johnny Hooyberghs",
    "Description": "Can you use .NET 9 to charge your electric car using solar power? Absolutely!\r\nIn this session, Johnny will show you how to leverage your development skills and .NET 9 to combine data from external vendors by using their API's and be smart with that data to command your electric vehicle to charge when the time is right.\r\nJohnny even added some AI to the mix to be able to ask questions about the current charging state using Azure OpenAI for the LLM, Semantic Kernel to create a custom copilot, and Azure Cognitive Services for Speech-To-Text.\r\nThis demo is not something that is put together for this talk, it is a cloud-native distributed application used by Johnny on a day-to-day basis."
  },
  {
    "SessionId": 61,
    "BeginDateTime": "2024-11-14T08:30:00-08:00",
    "EndDateTime": "2024-11-14T09:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T00:30:00Z",
    "EndDateTimeInCST": "2024-11-15T01:00:00Z",
    "Title": "Getting Started with OpenTelemetry in .NET",
    "Speaker": "Frank Boucher, Jason Hand",
    "Description": "In this session, we will show you how to instrument a .NET Blazor application to use OpenTelemetry and .NET Aspire to help us visualize what is really happening in our application. We will than see how we can add OpenTelemetry exporters and use different solution: Azure Application Insight or Datadog APM to collect those OpenTelemetry metrics and traces and how it could help us."
  },
  {
    "SessionId": 62,
    "BeginDateTime": "2024-11-14T09:00:00-08:00",
    "EndDateTime": "2024-11-14T09:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T01:00:00Z",
    "EndDateTimeInCST": "2024-11-15T01:30:00Z",
    "Title": "New tools in Visual Studio for Web API developers",
    "Speaker": "Sayed Hashimi",
    "Description": "There's so much new good stuff in Visual Studio for ASP.NET Core Web API developers. We've added lots of features to HTTP files and we are making it easier for you to develop Web APIs. Sayed will give a tour of all the new features and support for Web API developers."
  },
  {
    "SessionId": 63,
    "BeginDateTime": "2024-11-14T09:30:00-08:00",
    "EndDateTime": "2024-11-14T10:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T01:30:00Z",
    "EndDateTimeInCST": "2024-11-15T02:00:00Z",
    "Title": "Extending ASP.NET Core OpenAPI - Enrich your OpenAPI documents with examples, descriptions and more!",
    "Speaker": "Martin Costello",
    "Description": "In this session we'll take a look into the transformation interfaces that ship as part of the Microsoft.AspNetCore.OpenApi NuGet package in ASP.NET Core 9 to see how we can build on top of them to enrich an OpenAPI document.\r\n\r\nUsing document, operation and schema transformers, we'll take a look at an approach to add rich examples and descriptions to an API to help make it even easier for other developers to create an integration that depends on our application's API."
  },
  {
    "SessionId": 64,
    "BeginDateTime": "2024-11-14T10:00:00-08:00",
    "EndDateTime": "2024-11-14T10:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T02:00:00Z",
    "EndDateTimeInCST": "2024-11-15T02:30:00Z",
    "Title": "Clean Architecture with ASP.NET Core 9",
    "Speaker": "Steve Smith",
    "Description": "ASP.NET Core 9 provides better support for clean, testable, maintainable architectures than any of its predecessors. Learn the underlying principles that apply to project/solution organization, how best to arrange your projects to support clean code, and how to refactor existing solutions toward this architecture. Examples will use ASP.NET Core but the principles covered apply to all languages and platforms."
  },
  {
    "SessionId": 65,
    "BeginDateTime": "2024-11-14T11:00:00-08:00",
    "EndDateTime": "2024-11-14T11:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T03:00:00Z",
    "EndDateTimeInCST": "2024-11-15T03:30:00Z",
    "Title": "Community Toolkit Roundup",
    "Speaker": "Gerald Versluis, Michael Hawker, Adrian Hall",
    "Description": "The past year the Community Toolkit family has been growing, and we've welcomed the .NET Aspire Toolkit and Datasync Toolkit. So it's about time we update you with the latest and greatest.\r\n\r\nJoin a lively discussion with maintainers of the Community Toolkits, the .NET Community Toolkit, the MAUI Community Toolkit, and the Windows Community Toolkit. Learn about these open-source projects which aim to provide useful and high-quality components, controls, and utilities for .NET developers.\r\n\r\nDiscover how you can get involved, contribute, and benefit from these amazing toolkits that cover various .NET platforms and technologies. Whether you are developing desktop, mobile, web, or cross-platform applications, there is a Toolkit for you!"
  },
  {
    "SessionId": 66,
    "BeginDateTime": "2024-11-14T11:30:00-08:00",
    "EndDateTime": "2024-11-14T12:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T03:30:00Z",
    "EndDateTimeInCST": "2024-11-15T04:00:00Z",
    "Title": "State of the .NET Foundation and .NET Open Source",
    "Speaker": "Kevin Griffin, Mitchel Sellers",
    "Description": "We discuss the .NET Foundation's current state, what we'd like to do moving forward, and how the .NET community can get involved. We also highlight some new projects recently added to the Foundation."
  },
  {
    "SessionId": 67,
    "BeginDateTime": "2024-11-14T12:00:00-08:00",
    "EndDateTime": "2024-11-14T12:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T04:00:00Z",
    "EndDateTimeInCST": "2024-11-15T04:30:00Z",
    "Title": "Building .NET Applications with .NET Aspire and AWS",
    "Speaker": "Norm Johanson",
    "Description": "Aspire, the .NET Cloud Native development platform is a multi cloud development platform. This session you will learn how you can use Aspire to integrate AWS into your development environment. The combined integration of Aspire and AWS can remove the need for collection of tools to a simple F5 debug session that starts your application with all of AWS resources provisioned and connected to your application."
  },
  {
    "SessionId": 68,
    "BeginDateTime": "2024-11-14T12:30:00-08:00",
    "EndDateTime": "2024-11-14T13:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T04:30:00Z",
    "EndDateTimeInCST": "2024-11-15T05:00:00Z",
    "Title": "Orleans: Microsoft's distributed systems framework for .NET",
    "Speaker": "Reuben Bond",
    "Description": "Microsoft Orleans underpins many cloud services at Microsoft. It gives teams a straightforward approach to building efficient, reliable, elastically scalable cloud services quickly. In this session we will introduce Orleans and describe its core features and what's new in 2024. We will follow with a technical dive deep into placement & load balancing in Orleans, covering the latest advancements for reliability and performance, including some cutting-edge recent work in rebalancing & locality-aware repartitioning."
  },
  {
    "SessionId": 69,
    "BeginDateTime": "2024-11-14T13:00:00-08:00",
    "EndDateTime": "2024-11-14T13:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T05:00:00Z",
    "EndDateTimeInCST": "2024-11-15T05:30:00Z",
    "Title": "What's New for Oracle Database in .NET 9 and Entity Framework Core 9",
    "Speaker": "Alex Keh",
    "Description": "Learn about the new .NET 9 and EF Core 9 capabilities supported with Oracle Data Provider for .NET (ODP.NET). New .NET and Oracle database capabilities include controlling query parameterization, inlined uncorrelated subqueries, ToHashSetAsync methods support, passing complex type instances to ExecuteUpdate, auto-compiled models, and more. Join this session to see demos of these new features."
  },
  {
    "SessionId": 70,
    "BeginDateTime": "2024-11-14T13:30:00-08:00",
    "EndDateTime": "2024-11-14T14:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T05:30:00Z",
    "EndDateTimeInCST": "2024-11-15T06:00:00Z",
    "Title": "Unpacking the Newest in NuGet",
    "Speaker": "Allie Barry, Jon Douglas",
    "Description": "This session dives into the newest features and updates in NuGet, the package manager that powers .NET development. Whether you're a seasoned developer or just starting out, this talk will give you a comprehensive overview of what’s new in NuGet, how these features can streamline your workflow, and why they matter for your projects."
  },
  {
    "SessionId": 71,
    "BeginDateTime": "2024-11-14T14:00:00-08:00",
    "EndDateTime": "2024-11-14T14:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T06:00:00Z",
    "EndDateTimeInCST": "2024-11-15T06:30:00Z",
    "Title": ".NET Cross-Platform Development Supercharged with .NET 9, and Uno Platform",
    "Speaker": "Jérôme Laban",
    "Description": "The gap between the complexity of applications and the resources available to build them is widening rapidly. As developers, it's crucial to leverage familiar tools while embracing new ones that enhance productivity. \r\n  \r\nJoin Jerome Laban for an in-depth session on the latest advancements in the Uno Platform, including the newest support for .NET 9 . Jerome will discuss the performance benefits of moving to NET 9, the advantages of true single-project architecture and importance of using visual tooling such as Hot Reload and others.\r\n\r\nWhile AI is reshaping our industry, let's take a pragmatic approach to software development in\r\n2024. This session will help you cut through the buzz and focus on the tools that can deliver real\r\nvalue to your projects today."
  },
  {
    "SessionId": 72,
    "BeginDateTime": "2024-11-14T14:30:00-08:00",
    "EndDateTime": "2024-11-14T15:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T06:30:00Z",
    "EndDateTimeInCST": "2024-11-15T07:00:00Z",
    "Title": "New Features in the .NET 9 JIT",
    "Speaker": "Andy Ayers",
    "Description": "A deep dive into some of the many improvements made in the .NET 9 JIT, including new loop optimizations, stack allocation of objects, ARM64 SVE, improvements in AVX-512, and more!"
  },
  {
    "SessionId": 73,
    "BeginDateTime": "2024-11-14T15:00:00-08:00",
    "EndDateTime": "2024-11-14T15:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T07:00:00Z",
    "EndDateTimeInCST": "2024-11-15T07:30:00Z",
    "Title": "Modernizing .NET Apps with Upgrade Assistant: New Capabilities for Seamless Upgrades",
    "Speaker": "McKenna Barlow",
    "Description": "In this session, we'll explore the latest enhancements to the .NET Upgrade Assistant, focusing on new capabilities designed to simplify and streamline your upgrade process. You'll learn how the tool now supports comprehensive upgrade assessments, providing in-depth insights into project compatibility and upgrade complexity. We’ll also cover expanded package support, including Central Package Management (CPM), to help you manage dependencies more efficiently. Whether you're modernizing legacy applications or preparing for future upgrades, this session will equip you with the knowledge and tools to make the transition smoother and faster."
  },
  {
    "SessionId": 74,
    "BeginDateTime": "2024-11-14T15:30:00-08:00",
    "EndDateTime": "2024-11-14T16:00:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T07:30:00Z",
    "EndDateTimeInCST": "2024-11-15T08:00:00Z",
    "Title": "C++ Interopability in .NET",
    "Speaker": "Justin Pierce",
    "Description": "Wield the power of over 25 years of C++ native libraries within .NET, using C#'s advanced interoperability features."
  },
  {
    "SessionId": 75,
    "BeginDateTime": "2024-11-14T16:00:00-08:00",
    "EndDateTime": "2024-11-14T16:30:00-08:00",
    "BeginDateTimeInCST": "2024-11-15T08:00:00Z",
    "EndDateTimeInCST": "2024-11-15T08:30:00Z",
    "Title": "Next-gen SQL projects with Microsoft.Build.Sql",
    "Speaker": "Drew Skwiers-Koballa",
    "Description": "Your database objects are stored as code for development in Visual Studio or VS Code with Microsoft.Build.Sql SDK-style SQL projects, but the advantages don’t stop there. SQL code analysis and other build-time tests can validate database code quality and correctness during continuous integration of code changes. With SQL projects delivering database object updates is easier and more reliable whether you're managing one database or a fleet of databases because the deployment plan is dynamically calculated through the SqlPackage CLI. In this session we’ll learn how to develop and deploy your database alongside your app components with SQL projects from the IDE to CI/CD."
  }
]