[
  {
    "SessionId": 1,
    "BeginDateTime": "2024-11-12T16:00:00+00:00",
    "EndDateTime": "2024-11-12T17:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T00:00:00Z",
    "EndDateTimeInCST": "2024-11-13T01:00:00Z",
    "Title": "Keynote - Welcome to .NET 9",
    "Speaker": "James Montemagno, Damian Edwards, Maddy Montaquila, Maria Naggaga, Steve Sanderson, Safia Abdalla, Daniel Roth, David Ortinau, Filisha Shah",
    "Description": ".NET 9 is here elevating cloud-native and intelligent app development, focusing on productivity enhancements, streamlined deployments, and accelerated AI integration, ensuring superior performance for developers across various applications.",
    "DescriptionInZh": ".NET 9 提升了云原生和智能应用程序开发，专注于提高生产力、简化部署和加速 AI 集成，确保开发人员在各种应用程序中获得卓越的性能。"
  },
  {
    "SessionId": 2,
    "BeginDateTime": "2024-11-12T17:00:00+00:00",
    "EndDateTime": "2024-11-12T17:45:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T01:00:00Z",
    "EndDateTimeInCST": "2024-11-13T01:45:00Z",
    "Title": "What's new in .NET Aspire",
    "Speaker": "Maddy Montaquila, Damian Edwards",
    "Description": ".NET Aspire 9.0 is packed with new features to streamline your app development. New dashboard updates, custom commands, more powerful container start/stop/lifecycle management, new Integrations, and preview support for Azure Functions are packed into this release. Join .NET Product Managers Damian Edwards and Maddy Montaquila to find out why you should be using .NET Aspire in all your apps, and how .NET 9 will make them even better!",
    "DescriptionInZh": ".NET Aspire 9.0 包含新功能，可简化您的应用程序开发。此版本包含新的仪表板更新、自定义命令、更强大的容器启动/停止/生命周期管理、新的集成以及对 Azure Functions 的预览支持。加入 .NET 产品经理 Damian Edwards 和 Maddy Montaquila，了解为什么应该在所有应用程序中使用 .NET Aspire，以及 .NET 9 如何使它们变得更好！"
  },
  {
    "SessionId": 3,
    "BeginDateTime": "2024-11-12T17:45:00+00:00",
    "EndDateTime": "2024-11-12T18:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T01:45:00Z",
    "EndDateTimeInCST": "2024-11-13T02:30:00Z",
    "Title": "AI Building Blocks - A new, unified AI layer",
    "Speaker": "Steve Sanderson",
    "Description": "Most .NET apps can be made more powerful and productive through AI features, such as semantic search, auto-classification, summarization, translation, data extraction, and even chat-based assistants. But until now there's been no single standard representation for AI concepts within .NET itself, so developers needed to combine many unrelated APIs.\r\n \r\nMicrosoft.Extensions.AI addresses this by providing a new set of standard APIs for AI services, including large language models (LLMs) running locally on your workstation or as hosted services, integrating with text embeddings, vector stores, and more.\r\n \r\nIn this talk we'll demonstrate how these new standard abstractions let you combine multiple services that can easily be swapped and changed over time, and how you can plug into the internals for more advanced scenarios. By the end you'll be ready to start experimenting with new AI features in your own apps.",
    "DescriptionInZh": "大多数 .NET 应用程序都可以通过 AI 功能变得更加强大和高效，例如语义搜索、自动分类、摘要、翻译、数据提取，甚至是基于聊天的助手。但到目前为止，.NET 本身中没有 AI 概念的单一标准表示，因此开发人员需要组合许多不相关的 API。\r\n \r\nMicrosoft.Extensions.AI 通过为 AI 服务提供一组新的标准 API 来解决这个问题，包括在您的工作站上本地运行或作为托管服务运行的大型语言模型 （LLM），以及与文本嵌入、矢量存储等集成。\r\n \r\n在本次演讲中，我们将演示这些新的标准抽象如何让您组合多个服务，这些服务可以很容易地随着时间的推移而交换和更改，以及如何插入内部结构以实现更高级的场景。最后，您就可以开始在自己的应用程序中尝试新的 AI 功能了。"
  },
  {
    "SessionId": 4,
    "BeginDateTime": "2024-11-12T18:30:00+00:00",
    "EndDateTime": "2024-11-12T19:15:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T02:30:00Z",
    "EndDateTimeInCST": "2024-11-13T03:15:00Z",
    "Title": "What's new in C# 13",
    "Speaker": "Mads Torgersen, Dustin Campbell",
    "Description": "Join Mads and Dustin from the C# design team as they take you through new features in C# 13 and beyond.",
    "DescriptionInZh": "加入 C# 设计团队的 Mads 和 Dustin，他们将带您了解 C# 13 及更高版本中的新功能。"
  },
  {
    "SessionId": 5,
    "BeginDateTime": "2024-11-12T19:15:00+00:00",
    "EndDateTime": "2024-11-12T20:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T03:15:00Z",
    "EndDateTimeInCST": "2024-11-13T04:00:00Z",
    "Title": "What's New for ASP.NET Core & Blazor in .NET 9",
    "Speaker": "Daniel Roth",
    "Description": "In this session we'll go over all the improvements coming to ASP.NET Core & Blazor in .NET 9, including various performance improvements, optimized static web asset handling, improved Blazor reconnection logic, built-in OpenAPI support, improved distributed caching, and much more!",
    "DescriptionInZh": "在本次会议中，我们将介绍 ASP.NET Core和Blazor在.NET 9中的所有改进，包括各种性能改进、优化的静态网页资产处理、改进的Blazor重新连接逻辑、内置的OpenAPI支持、改进的分布式缓存等等！"
  },
  {
    "SessionId": 6,
    "BeginDateTime": "2024-11-12T20:00:00+00:00",
    "EndDateTime": "2024-11-12T20:45:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T04:00:00Z",
    "EndDateTimeInCST": "2024-11-13T04:45:00Z",
    "Title": "What's New in .NET MAUI in .NET 9",
    "Speaker": "David Ortinau, Rachel Kang (SHE/HER)",
    "Description": "More and more companies are building mobile and desktop apps with .NET MAUI, and .NET 9 is now here to continue improving those business-critical app experiences. In this session we’ll introduce you to what’s new in .NET 9, how companies are being successful shipping production quality applications with .NET MAUI, and how you can get the most out of Visual Studio and Visual Studio Code.",
    "DescriptionInZh": "越来越多的公司正在使用 .NET MAUI 构建移动和桌面应用程序，而 .NET 9 现在可用于继续改进这些业务关键型应用程序体验。在本次会议中，我们将向你介绍 .NET 9 中的新增功能、公司如何使用 .NET MAUI 成功交付生产质量的应用程序，以及如何充分利用 Visual Studio 和 Visual Studio Code。"
  },
  {
    "SessionId": 7,
    "BeginDateTime": "2024-11-12T20:45:00+00:00",
    "EndDateTime": "2024-11-12T21:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T04:45:00Z",
    "EndDateTimeInCST": "2024-11-13T05:30:00Z",
    "Title": "What's new in the .NET Runtime, Libraries, & SDK",
    "Speaker": "Richard Lander, Immo Landwerth",
    "Description": "Find out about some of the exciting features .NET 9 is bringing to the runtime, libraries, and SDK! The runtime includes dynamic adaptation to application sizes for garbage collection, new attribute models for feature switches, and numerous performance enhancements. The libraries see updates like nullable reference type annotations in System.Text.Json, new LINQ methods (CountBy and AggregateBy), and a new Base64Url class for URL-safe encoding. The SDK introduces workload sets, improved unit testing integration, and enhanced NuGet security audits. Come join us to learn about .NET features you can start using today in your .NET 9 applications!",
    "DescriptionInZh": "了解 .NET 9 为运行时、库和 SDK 带来的一些令人兴奋的功能！运行时包括对应用程序大小的动态适应以进行垃圾回收、功能切换的新属性模型以及许多性能增强。这些库看到了更新，例如 System.Text.Json 中的可为 null 引用类型注释、新的 LINQ 方法（CountBy 和 AggregateBy）以及用于 URL 安全编码的新 Base64Url 类。SDK 引入了工作负载集、改进的单元测试集成和增强的 NuGet 安全审核。快来加入我们，了解您今天可以在 .NET 9 应用程序中开始使用的 .NET 功能！"
  },
  {
    "SessionId": 8,
    "BeginDateTime": "2024-11-12T21:30:00+00:00",
    "EndDateTime": "2024-11-12T22:15:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T05:30:00Z",
    "EndDateTimeInCST": "2024-11-13T06:15:00Z",
    "Title": "Performance Improvements in .NET 9",
    "Speaker": "Stephen Toub",
    "Description": ".NET 9 is the fastest .NET to date, with a huge number of performance improvements throughout the stack. In this session, we'll take a tour through some of these optimizations and see how .NET 9 will make your applications and services fly.",
    "DescriptionInZh": ".NET 9 是迄今为止最快的 .NET，在整个堆栈中具有大量性能改进。在本次会议中，我们将介绍其中一些优化，并了解 .NET 9 如何使您的应用程序和服务蓬勃发展。"
  },
  {
    "SessionId": 9,
    "BeginDateTime": "2024-11-12T22:15:00+00:00",
    "EndDateTime": "2024-11-12T22:45:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T06:15:00Z",
    "EndDateTimeInCST": "2024-11-13T06:45:00Z",
    "Title": "Building AI Applications from Scratch: A Hands-On Guide for .NET Developers",
    "Speaker": "Luis Quintanilla",
    "Description": "In this session, we'll guide you through the process of developing AI applications using .NET, Aspire, and Azure. Through live demonstrations, we’ll start by constructing a prototype AI application, showcasing how the same codebase and concepts can be adapted across different platforms. We’ll then explore how to scale this prototype into a robust enterprise AI solution using .NET Aspire, and demonstrate how .NET Aspire can be used to monitor your AI applications effectively. Lastly, we’ll walk you through the deployment process, highlighting how you can achieve comprehensive observability and production capabilities in the cloud. Join us for this hands-on session and learn how to transform your ideas into intelligent solutions.",
    "DescriptionInZh": "在本次会议中，我们将指导您完成使用 .NET、Aspire 和 Azure 开发 AI 应用程序的过程。通过现场演示，我们将首先构建一个原型 AI 应用程序，展示如何在不同平台上调整相同的代码库和概念。然后，我们将探讨如何使用 .NET Aspire 将此原型扩展为强大的企业 AI 解决方案，并演示如何使用 .NET Aspire 来有效地监控您的 AI 应用程序。最后，我们将引导您完成部署过程，重点介绍如何在云中实现全面的可观测性和生产能力。加入我们，参加此实践会议，了解如何将您的想法转化为智能解决方案。"
  },
  {
    "SessionId": 10,
    "BeginDateTime": "2024-11-12T22:45:00+00:00",
    "EndDateTime": "2024-11-12T23:15:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T06:45:00Z",
    "EndDateTimeInCST": "2024-11-13T07:15:00Z",
    "Title": "API-ly Ever After: OpenAPI in .NET 9",
    "Speaker": "Safia Abdalla, Mike Kistler",
    "Description": "In .NET 9, ASP.NET Core ships with built-in support for generating OpenAPI documents from minimal and controller-based APIs. In this session, we'll cover the key features of this new support, explore integration scenarios for OpenAPI, and discuss how your team can make the most of OpenAPI.",
    "DescriptionInZh": "在 .NET 9 中，ASP.NET Core 附带了对从最小 API 和基于控制器的 API 生成 OpenAPI 文档的内置支持。在本次会议中，我们将介绍这项新支持的主要功能，探索 OpenAPI 的集成场景，并讨论您的团队如何充分利用 OpenAPI。"
  },
  {
    "SessionId": 11,
    "BeginDateTime": "2024-11-12T23:15:00+00:00",
    "EndDateTime": "2024-11-12T23:45:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T07:15:00Z",
    "EndDateTimeInCST": "2024-11-13T07:45:00Z",
    "Title": "Build hybrid apps with .NET MAUI",
    "Speaker": "Beth Massi, Eilon Lipton",
    "Description": "In this session learn why you would choose a hybrid web approach to building native apps with .NET MAUI in .NET 9. Learn about Blazor hybrid and how you can build full-featured native apps for Windows, Mac, iOS and Android within a single codebase that can take advantage of your web skills. Take a tour of the new Blazor hybrid tools and templates in .NET 9 and see how you can reuse UI to build solutions that target the web at the same time. We'll also take a look at the new HybridWebView control and show how you can leverage other web frameworks in .NET MAUI.",
    "DescriptionInZh": "在本次会议中，了解为什么你会选择混合 Web 方法来使用 .NET 9 中的 .NET MAUI 构建本机应用。了解 Blazor 混合，以及如何在单个代码库中构建适用于 Windows、Mac、iOS 和 Android 的功能齐全的本机应用，从而利用您的 Web 技能。浏览 .NET 9 中的新 Blazor 混合工具和模板，了解如何重复使用 UI 来构建同时面向 Web 的解决方案。我们还将介绍新的 HybridWebView 控件，并展示如何利用 .NET MAUI 中的其他 Web 框架。"
  },
  {
    "SessionId": 12,
    "BeginDateTime": "2024-11-12T23:45:00+00:00",
    "EndDateTime": "2024-11-13T00:15:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T07:45:00Z",
    "EndDateTimeInCST": "2024-11-13T08:15:00Z",
    "Title": "What's new in Visual Studio 2022 for .NET developers",
    "Speaker": "Simona Liao, Junyu Wang",
    "Description": "Introducing exciting new features in Visual Studio 2022 for .NET developers with demos",
    "DescriptionInZh": "通过演示为 .NET 开发人员在 Visual Studio 2022 中引入令人兴奋的新功能"
  },
  {
    "SessionId": 13,
    "BeginDateTime": "2024-11-13T00:15:00+00:00",
    "EndDateTime": "2024-11-13T00:45:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T08:15:00Z",
    "EndDateTimeInCST": "2024-11-13T08:45:00Z",
    "Title": "Discover the Latest GitHub Copilot Features for .NET Developers in Visual Studio",
    "Speaker": "Rhea Patel",
    "Description": "Since its launch in 2021, GitHub Copilot has transformed the way developers write code by leveraging AI to enhance coding efficiency. Powered by advanced models from GitHub, OpenAI, and Microsoft, Copilot has continued to evolve. With the latest updates in Visual Studio, .NET developers have even more powerful tools at their disposal.",
    "DescriptionInZh": "自 2021 年推出以来，GitHub Copilot 通过利用 AI 提高编码效率，改变了开发人员编写代码的方式。Copilot 由 GitHub、OpenAI 和 Microsoft 的高级模型提供支持，不断发展。借助 Visual Studio 中的最新更新，.NET 开发人员可以使用更强大的工具。"
  },
  {
    "SessionId": 14,
    "BeginDateTime": "2024-11-13T00:45:00+00:00",
    "EndDateTime": "2024-11-13T01:45:00+00:00",
    "BeginDateTimeInCST": "2024-11-13T08:45:00Z",
    "EndDateTimeInCST": "2024-11-13T09:45:00Z",
    "Title": "CodeParty Attendee Party",
    "Speaker": "Jeffrey T. Fritz",
    "Description": "Join Jeff Fritz, Dee Dee Walsh, Sara Faatz and more special guests for our attendee party for some fun and prizes to be given away from our sponsors.",
    "DescriptionInZh": "与 Jeff Fritz、Dee Dee Walsh、Sara Faatz 和更多特邀嘉宾一起参加我们的与会者派对，享受一些乐趣，并从我们的赞助商那里获得奖品。"
  },
  {
    "SessionId": 15,
    "BeginDateTime": "2024-11-13T17:00:00+00:00",
    "EndDateTime": "2024-11-13T18:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T01:00:00Z",
    "EndDateTimeInCST": "2024-11-14T02:00:00Z",
    "Title": "Building and scaling cloud-native, intelligent applications on Azure and .NET",
    "Speaker": "Scott Hunter, Paul Yuknewicz",
    "Description": "Learn how to run cloud-native serverless and container applications in Azure using Azure Kubernetes Service and Azure Container Apps. We help you choose the right service for your apps. We show you how Azure is the best platform for hosting cloud native and intelligent apps, and an app using Azure OpenAI Service and Azure Data. Learn all the new capabilities of our container platforms including how to deploy, test for scale, monitor, and much more.",
    "DescriptionInZh": "了解如何使用 Azure Kubernetes 服务和 Azure 容器应用在 Azure 中运行云原生无服务器和容器应用程序。我们帮助您为您的应用程序选择合适的服务。我们将向你展示 Azure 如何成为托管云原生和智能应用的最佳平台，以及使用 Azure OpenAI 服务和 Azure Data 的应用。了解我们的容器平台的所有新功能，包括如何部署、扩展测试、监控等。"
  },
  {
    "SessionId": 16,
    "BeginDateTime": "2024-11-13T18:00:00+00:00",
    "EndDateTime": "2024-11-13T18:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T02:00:00Z",
    "EndDateTimeInCST": "2024-11-14T02:30:00Z",
    "Title": "Building and deploying an Azure Functions app with .NET Aspire in 25 minutes",
    "Speaker": "Safia Abdalla, Matthew Henderson",
    "Description": "Azure Functions is an event-driven serverless platform that makes it easy to build scalable and low-maintenance services in the cloud. .NET Aspire is .NET's modern framework for developing modern applications with a great developer loop. What happens you bring the two together? Pure magic! In this session, we'll go from zero to hero and build a .NET Aspire-enabled Azure Functions application together then deploy it to the cloud. Along the way, we'll learn about the new features in .NET Aspire and Azure Functions that make the development and deployment experience a total breeze.",
    "DescriptionInZh": "Azure Functions 是一个事件驱动的无服务器平台，可以轻松地在云中构建可缩放且维护成本低的服务。.NET Aspire 是 .NET 的现代框架，用于开发具有出色开发人员循环的现代应用程序。你怎么把这两者放在一起？纯粹的魔法！在本次会议中，我们将从零开始，共同构建支持 .NET Aspire 的 Azure Functions 应用程序，然后将其部署到云中。在此过程中，我们将了解 .NET Aspire 和 Azure Functions 中的新功能，这些功能使开发和部署体验变得轻而易举。"
  },
  {
    "SessionId": 17,
    "BeginDateTime": "2024-11-13T18:30:00+00:00",
    "EndDateTime": "2024-11-13T19:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T02:30:00Z",
    "EndDateTimeInCST": "2024-11-14T03:00:00Z",
    "Title": ".NET Aspire Roadmap, Vision, and Beyond",
    "Speaker": "David Fowler",
    "Description": ".NET Aspire is a powerful collection of tools and packages that help you develop cloud apps without all the confusion and overhead that comes with it. .NET Aspire shipped in May, and just had it's first major release since! Join David Fowler for a deep dive into the vision for Aspire and a look at the roadmap for the next few releases.",
    "DescriptionInZh": ".NET Aspire 是一个功能强大的工具和包集合，可帮助您开发云应用程序，而不会带来所有混乱和开销。.NET Aspire 于 5 月发布，并且刚刚发布了此后的第一个主要版本！与 David Fowler 一起深入探讨 Aspire 的愿景，并查看接下来几个版本的路线图。"
  },
  {
    "SessionId": 18,
    "BeginDateTime": "2024-11-13T19:00:00+00:00",
    "EndDateTime": "2024-11-13T19:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T03:00:00Z",
    "EndDateTimeInCST": "2024-11-14T03:30:00Z",
    "Title": "Introducing HybridCache in ASP.NET Core",
    "Speaker": "Marc Gravell",
    "Description": ""
  },
  {
    "SessionId": 19,
    "BeginDateTime": "2024-11-13T19:30:00+00:00",
    "EndDateTime": "2024-11-13T20:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T03:30:00Z",
    "EndDateTimeInCST": "2024-11-14T04:00:00Z",
    "Title": "Centrally managing your .NET APIs with Azure API Center",
    "Speaker": "Julia Kasper, Martyn Coupland",
    "Description": "In today’s rapidly evolving digital landscape, managing and governing APIs effectively is crucial for organizational success. Join us for an insightful session tailored specifically for .NET developers, where we will explore the latest features and best practices for leveraging Azure API Center to its fullest potential.\r\n\r\nDiscover how Azure API Center enables you to centralize your API inventory, ensuring seamless discovery, tracking, and governance across your organization. Learn how to develop and maintain a structured and organized inventory of your APIs, regardless of their type, lifecycle stage, or deployment location.",
    "DescriptionInZh": "在当今快速发展的数字环境中，有效地管理和治理 API 对于组织的成功至关重要。加入我们，参加专为 .NET 开发人员量身定制的富有洞察力的会议，我们将在其中探索充分利用 Azure API 中心的最新功能和最佳做法。\r\n\r\n了解 Azure API 中心如何使你能够集中 API 清单，确保在整个组织中无缝发现、跟踪和治理。了解如何开发和维护结构化和有序的 API 清单，无论其类型、生命周期阶段或部署位置如何。"
  },
  {
    "SessionId": 20,
    "BeginDateTime": "2024-11-13T20:00:00+00:00",
    "EndDateTime": "2024-11-13T20:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T04:00:00Z",
    "EndDateTimeInCST": "2024-11-14T04:30:00Z",
    "Title": "What's new in C# Dev Kit for VS Code",
    "Speaker": "Wendy Breiding (She/Her), Leslie Richardson",
    "Description": "Love VS Code? Working on Mac, Windows, or Linux? We'll show you how to get the most out of C# Dev Kit to be the most productive doing C# development in VS Code.",
    "DescriptionInZh": "喜欢 VS Code？在 Mac、Windows 或 Linux 上工作？我们将向您展示如何充分利用 C# 开发工具包，以最高效地在 VS Code 中进行 C# 开发。"
  },
  {
    "SessionId": 21,
    "BeginDateTime": "2024-11-13T20:30:00+00:00",
    "EndDateTime": "2024-11-13T21:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T04:30:00Z",
    "EndDateTimeInCST": "2024-11-14T05:00:00Z",
    "Title": "C#'s Best features you might not be using",
    "Speaker": "Bill Wagner",
    "Description": "Take a look at some great C# features that can make your code more resilient and easier to understand. This talk will help you improve the code your team writes right away because all of these features are available in C# 12, with many available in lower versions. You'll leave knowing not only what makes better code but why.",
    "DescriptionInZh": "了解一些出色的 C# 功能，这些功能可以使您的代码更具弹性且更易于理解。本次演讲将帮助您立即改进团队编写的代码，因为所有这些功能在 C# 12 中都可用，其中许多功能在较低版本中可用。您不仅会知道什么造就了更好的代码，而且知道为什么。"
  },
  {
    "SessionId": 22,
    "BeginDateTime": "2024-11-13T21:00:00+00:00",
    "EndDateTime": "2024-11-13T21:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T05:00:00Z",
    "EndDateTimeInCST": "2024-11-14T05:30:00Z",
    "Title": "openai-dotnet: the official OpenAI library for .NET",
    "Speaker": "Angelos Petropoulos",
    "Description": "Join us for an in-depth exploration of openai-dotnet, the .NET client library for OpenAI. In this session, we'll walk you through the key features and capabilities of the library, demonstrate how to integrate it into your .NET applications, and showcase real-world examples. Whether you're a seasoned developer or new to AI, you'll leave with the knowledge and tools to harness the power of OpenAI in your .NET projects. Don't miss this opportunity to get ahead of the curve and start building intelligent applications today!",
    "DescriptionInZh": "加入我们，深入了解 openai-dotnet（OpenAI 的 .NET 客户端库）。在本次会议中，我们将引导您了解该库的主要特性和功能，演示如何将其集成到 .NET 应用程序中，并展示实际示例。无论您是经验丰富的开发人员还是 AI 新手，您都将获得在 .NET 项目中利用 OpenAI 的知识和工具。不要错过这个机会，抢占先机，立即开始构建智能应用程序！"
  },
  {
    "SessionId": 23,
    "BeginDateTime": "2024-11-13T21:30:00+00:00",
    "EndDateTime": "2024-11-13T22:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T05:30:00Z",
    "EndDateTimeInCST": "2024-11-14T06:00:00Z",
    "Title": "Building the Foundation: AI Fundamentals in .NET",
    "Speaker": "Luis Quintanilla, Tanner Gooding, Tarek Sayed",
    "Description": "In this presentation, we will explore the core principles and foundational elements of Artificial Intelligence (AI) within the .NET ecosystem. This session will delve into the essential AI building blocks, including Tensors and Tokenizers, and demonstrate how these components are integrated and optimized within .NET. We will also highlight how these AI fundamentals build on top of existing investments in the .NET ecosystem, such as Span and Generic Math, to enhance performance and efficiency. Attendees will gain insights into the investments being made at the lower levels of the stack to ensure robust and efficient AI applications. Join us to discover how .NET is empowering developers to build intelligent solutions from the ground up, laying a strong foundation for future innovations.",
    "DescriptionInZh": "在本演示文稿中，我们将探讨 .NET 生态系统中人工智能 （AI） 的核心原则和基本要素。本次会议将深入探讨基本的 AI 构建块，包括 Tensor 和 Tokenizers，并演示如何在 .NET 中集成和优化这些组件。我们还将重点介绍这些 AI 基础知识如何建立在 .NET 生态系统中的现有投资（如 Span 和 Generic Math）之上，以提高性能和效率。与会者将深入了解在堆栈的较低级别进行的投资，以确保 AI 应用程序强大而高效。加入我们，了解 .NET 如何使开发人员能够从头开始构建智能解决方案，为未来的创新奠定坚实的基础。"
  },
  {
    "SessionId": 24,
    "BeginDateTime": "2024-11-13T22:00:00+00:00",
    "EndDateTime": "2024-11-13T22:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T06:00:00Z",
    "EndDateTimeInCST": "2024-11-14T06:30:00Z",
    "Title": "Navigating the world of AI Models in .NET",
    "Speaker": "Jordan Matthiesen",
    "Description": "As the field of artificial intelligence continues to grow and evolve, the number of available AI models is rapidly expanding. With models like Phi, Mistral, and many others, concepts like small local models and foundational models,  it can be overwhelming to navigate this complex landscape. This talk will explore how frameworks like Semantic Kernel and tools like Ollama make it easy to work with these models inside your .NET applications. Learn how to harness the power of the latest AI models to build intelligent, cutting-edge applications with ease. Join us on quick dive into the world of .NET and AI models!",
    "DescriptionInZh": "随着人工智能领域的不断发展，可用的 AI 模型数量正在迅速增加。对于 Phi、Mistral 等模型，以及小型本地模型和基础模型等概念，驾驭这种复杂的环境可能会让人不知所措。本次演讲将探讨 Semantic Kernel 等框架和 Ollama 等工具如何让您在 .NET 应用程序中轻松使用这些模型。了解如何利用最新 AI 模型的强大功能轻松构建智能、尖端的应用程序。加入我们，快速深入了解 .NET 和 AI 模型的世界！"
  },
  {
    "SessionId": 25,
    "BeginDateTime": "2024-11-13T22:30:00+00:00",
    "EndDateTime": "2024-11-13T23:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T06:30:00Z",
    "EndDateTimeInCST": "2024-11-14T07:00:00Z",
    "Title": ".NET MAUI Performance Optimizations with NativeAOT and Trimming",
    "Speaker": "Jonathan Peppers",
    "Description": "Jon will walk through the latest features in .NET 9 to make your iOS and Android apps smaller and faster. Can you use System.Reflection? It depends! Jon will walk through the details in making your code NativeAOT and fully-trim compatible, showing the improvements to app size and startup time. This session will also be useful for NuGet package authors that want to ship libraries that can be fully optimized for mobile or self-contained deployments.",
    "DescriptionInZh": "Jon 将介绍 .NET 9 中的最新功能，以使您的 iOS 和 Android 应用程序更小、更快。您可以使用 System.Reflection 吗？这要看情况！Jon 将详细介绍如何使代码 NativeAOT 和 trim 完全兼容，并展示对应用程序大小和启动时间的改进。对于希望提供可针对移动或独立部署进行全面优化的库的 NuGet 包作者，此会话也非常有用。"
  },
  {
    "SessionId": 26,
    "BeginDateTime": "2024-11-13T23:00:00+00:00",
    "EndDateTime": "2024-11-13T23:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T07:00:00Z",
    "EndDateTimeInCST": "2024-11-14T07:30:00Z",
    "Title": "What's new in WinUI and Windows App SDK 1.6",
    "Speaker": "Michael Hawker, Michael Jolley",
    "Description": "Companies are building apps used by millions of users on Windows Desktop with WinUI and Windows App SDK. Are you missing out? Come here and find out! This session will cover the latest features released in WinUI and the Windows App SDK, its integration with .NET and Native AOT, how you can get started using these technologies in your Win32 applications, and a look ahead!",
    "DescriptionInZh": "公司正在使用 WinUI 和 Windows App SDK 构建数百万用户在 Windows 桌面上使用的应用程序。您是否错过了？快来这里了解一下吧！本次会议将介绍 WinUI 和 Windows 应用程序 SDK 中发布的最新功能、它与 .NET 和本机 AOT 的集成、如何开始在 Win32 应用程序中使用这些技术，以及展望未来！"
  },
  {
    "SessionId": 27,
    "BeginDateTime": "2024-11-13T23:30:00+00:00",
    "EndDateTime": "2024-11-14T00:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T07:30:00Z",
    "EndDateTimeInCST": "2024-11-14T08:00:00Z",
    "Title": "Easily Improve Web Application Performance using .NET 9 Caching and Redis",
    "Speaker": "Catherine Wang, Matt Soucoup",
    "Description": "Does your web application experience performance bottlenecks caused by repeated data queries? Does it feel annoying having to write so much boilerplate code to use Redis for caching? We are introducing the .NET 9 Hybrid Cache interface that simplifies caching with Redis down to a single line of code! Furthermore, you can simply extend your existing application to become intelligent with Redis being a vector datastore and semantic cache, while preserving all the performance benefits. Samples and demos will be provided to showcase the Redis capabilities and best practices.",
    "DescriptionInZh": "您的 Web 应用程序是否遇到重复数据查询导致的性能瓶颈？必须编写这么多样板代码才能使用 Redis 进行缓存，这感觉很烦人吗？我们推出了 .NET 9 混合缓存接口，该接口可将 Redis 的缓存简化为一行代码！此外，您只需扩展现有应用程序即可实现智能，Redis 是矢量数据存储和语义缓存，同时保留所有性能优势。将提供示例和演示来展示 Redis 功能和最佳实践。"
  },
  {
    "SessionId": 28,
    "BeginDateTime": "2024-11-14T00:00:00+00:00",
    "EndDateTime": "2024-11-14T00:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T08:00:00Z",
    "EndDateTimeInCST": "2024-11-14T08:30:00Z",
    "Title": "Modern WinForms Development with .NET 9",
    "Speaker": "Merrie McGaw, Klaus Loeffelman",
    "Description": "Join us as we look at the new features coming your way in WinForms for .NET 9. Check out some awesome ideas for incorporating Copilot into your applications as well as modern UI updates.",
    "DescriptionInZh": "加入我们，看看 WinForms for .NET 9 中即将推出的新功能。查看一些将 Copilot 整合到您的应用程序中的绝妙想法以及现代 UI 更新。"
  },
  {
    "SessionId": 29,
    "BeginDateTime": "2024-11-14T00:30:00+00:00",
    "EndDateTime": "2024-11-14T01:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T08:30:00Z",
    "EndDateTimeInCST": "2024-11-14T09:00:00Z",
    "Title": "Build your own .NET Aspire integrations",
    "Speaker": "Aaron Powell, David Pine",
    "Description": "One of the core parts of .NET Aspire is the ability to add integrations into your app host or project code to streamline your resource setup and development. The .NET Aspire team has built a bunch of integrations, but if there's something else you need, you can build it yourself! Join some folks from the .NET Aspire team to learn how integrations work, how to build one, and how you could even contribute to the new .NET Aspire Community Toolkit.",
    "DescriptionInZh": ".NET Aspire 的核心部分之一是能够将集成添加到您的应用程序主机或项目代码中，以简化您的资源设置和开发。.NET Aspire 团队已经构建了一系列集成，但如果你还需要其他东西，你可以自己构建它！加入 .NET Aspire 团队的一些人员，了解集成的工作原理、如何构建集成，以及您如何为新的 .NET Aspire 社区工具包做出贡献。"
  },
  {
    "SessionId": 30,
    "BeginDateTime": "2024-11-14T01:00:00+00:00",
    "EndDateTime": "2024-11-14T01:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T09:00:00Z",
    "EndDateTimeInCST": "2024-11-14T09:30:00Z",
    "Title": "Build Your First GitHub Copilot Extension",
    "Speaker": "Brian Randell",
    "Description": "Unlock the potential of GitHub Copilot by learning how to build an extension for yourself or your organization. Whether you're new to GitHub Copilot or an experienced developer looking to customize your coding assistant, this session is designed to guide you through the process of quickly creating an extension for yourself or your organization.\r\n\r\nIn just 30 minutes, Brian will share the key concepts behind GitHub Copilot extensibility, explore real-world use cases, and help you walk away with the knowledge to build, test, and deploy your first extension using C# and ASP.NET Core. You’ll see how to use Visual Studio 2022 to build & debug your extension from nothing to something.\r\n\r\nPerfect for developers of all levels, this session will include:\r\n•\tAn introduction to GitHub Copilot extensibility\r\n•\tA live demo of building a simple extension\r\n•\tTips and best practices for customizing GitHub Copilot to enhance productivity\r\n\r\nDon’t miss this opportunity to get a head start in making GitHub Copilot work for you!",
    "DescriptionInZh": "通过学习如何为自己或您的组织构建扩展，释放 GitHub Copilot 的潜力。无论您是 GitHub Copilot 的新手，还是希望自定义编码助手的经验丰富的开发人员，此会话都旨在指导您完成为您自己或您的组织快速创建扩展的过程。\r\n\r\n在短短 30 分钟内，Brian 将分享 GitHub Copilot 可扩展性背后的关键概念，探索实际用例，并帮助您掌握使用 C# 和 ASP.NET Core 构建、测试和部署您的第一个扩展的知识。你将看到如何使用Visual Studio 2022构建和调试你的扩展，从无到有。\r\n\r\n本次会议非常适合所有级别的开发人员，包括：\r\n• GitHub Copilot 可扩展性简介\r\n• 构建简单扩展的现场演示\r\n• 自定义 GitHub Copilot 以提高工作效率的提示和最佳实践\r\n\r\n不要错过这个机会，让 GitHub Copilot 为您服务！"
  },
  {
    "SessionId": 31,
    "BeginDateTime": "2024-11-14T01:30:00+00:00",
    "EndDateTime": "2024-11-14T02:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T09:30:00Z",
    "EndDateTimeInCST": "2024-11-14T10:00:00Z",
    "Title": "Using Blazor to manage data in SQL server and Microsoft Fabric",
    "Speaker": "Michael Washington",
    "Description": "Many business applications need to allow their users to view and update data in SQL server and data warehouses such as Microsoft Fabric. Learn how to create custom applications using Microsoft Blazor and free open-source controls such as Blazor Data Sheet to rapidly implement solutions to your users. Learn how to implement row level security to control access to the data in a granular way. Finally learn how to use PowerBI embedded to provide advanced data analytics.",
    "DescriptionInZh": "许多业务应用程序需要允许其用户查看和更新 SQL Server 和数据仓库（如 Microsoft Fabric）中的数据。了解如何使用 Microsoft Blazor 和免费的开源控件（如 Blazor 数据表）创建自定义应用程序，以便为用户快速实施解决方案。了解如何实施行级安全性，以精细的方式控制对数据的访问。最后，了解如何使用 PowerBI Embedded 提供高级数据分析。"
  },
  {
    "SessionId": 32,
    "BeginDateTime": "2024-11-14T02:00:00+00:00",
    "EndDateTime": "2024-11-14T02:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T10:00:00Z",
    "EndDateTimeInCST": "2024-11-14T10:30:00Z",
    "Title": "From Figma to .NET MAUI: Transform Your Designs into XAML Code in Seconds",
    "Speaker": "Héctor Uriel Pérez Rojas",
    "Description": "In this session, I will share my journey in developing a tool called Xamlify, which allows me to convert Figma designs into XAML code in .NET MAUI in just a few seconds, enabling me to reduce the time spent on creating graphical interfaces by 80% to 90%. I achieved this using Blazor, a lot of C# code, and Azure OpenAI.",
    "DescriptionInZh": "在本次会议中，我将分享我开发名为 Xamlify 的工具的过程，该工具允许我在几秒钟内将 Figma 设计转换为 .NET MAUI 中的 XAML 代码，从而使我能够将创建图形界面所花费的时间减少 80% 到 90%。我使用 Blazor、大量 C# 代码和 Azure OpenAI 实现了这一点。"
  },
  {
    "SessionId": 33,
    "BeginDateTime": "2024-11-14T02:30:00+00:00",
    "EndDateTime": "2024-11-14T03:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T10:30:00Z",
    "EndDateTimeInCST": "2024-11-14T11:00:00Z",
    "Title": "Master Visual Studio Debugging: Tips, Tricks, and AI Insights!",
    "Speaker": "Harshada Hole",
    "Description": "Join us for an engaging session that combines essential Visual Studio debugging techniques with the power of Co-Pilot's AI assistance.\r\n\r\nLearn how to debug more efficiently, from breakpoints to watch windows, and discover how Co-Pilot can optimize your workflow with intelligent, context-aware suggestions tailored to your coding style. \r\n\r\n Elevate your debugging skills and fully leverage the capabilities of Visual Studio in this concise and insightful session.",
    "DescriptionInZh": "加入我们，参加一场引人入胜的会议，将基本的 Visual Studio 调试技术与 Co-Pilot 的 AI 辅助功能相结合。\r\n\r\n了解如何更高效地调试（从断点到监视窗口），并了解 Co-Pilot 如何通过根据您的编码风格量身定制的智能上下文感知建议来优化您的工作流程。\r\n\r\n在这个简洁而富有洞察力的会议中，提升您的调试技能并充分利用 Visual Studio 的功能。"
  },
  {
    "SessionId": 34,
    "BeginDateTime": "2024-11-14T03:00:00+00:00",
    "EndDateTime": "2024-11-14T03:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T11:00:00Z",
    "EndDateTimeInCST": "2024-11-14T11:30:00Z",
    "Title": "Testing.Platform, the new way to run .NET tests",
    "Speaker": "Jakub Jares",
    "Description": "Testing platform is a new way to run .NET tests that we developed at Microsoft as an alternative to VSTest. This new platform is lightweight, modular, and distributed completely as nuget packages. It builds test projects into executables, is easy to extend and can run almost anywhere.\r\n\r\nIn this talk I will show you what Testing platform is, how to use it to run tests using popular testing frameworks MSTest, NUnit and XUnit.\r\n\r\nI will also show what are the benefits of this new testing platform over VSTest, and how to use them to your advantage. Such as portability, self-contained tests, running tests with Native AOT and so on.\r\n\r\nYou will learn about our design process, the pillars of our new testing platform and the improvements it allowed us to do in MSTest.",
    "DescriptionInZh": "测试平台是我们在 Microsoft 开发的一种运行 .NET 测试的新方法，作为 VSTest 的替代方案。这个新平台是轻量级的、模块化的，并且完全作为 nuget 包分发。它将测试项目构建为可执行文件，易于扩展，几乎可以在任何地方运行。\r\n\r\n在本次演讲中，我将向您展示什么是测试平台，如何使用流行的测试框架 MSTest、NUnit 和 XUnit 来运行测试。\r\n\r\n我还将展示这个新测试平台相对于 VSTest 有哪些优势，以及如何利用它们来发挥自己的优势。例如可移植性、自包含测试、使用 Native AOT 运行测试等。\r\n\r\n您将了解我们的设计流程、新测试平台的支柱以及它允许我们在 MSTest 中进行的改进。"
  },
  {
    "SessionId": 35,
    "BeginDateTime": "2024-11-14T03:30:00+00:00",
    "EndDateTime": "2024-11-14T04:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T11:30:00Z",
    "EndDateTimeInCST": "2024-11-14T12:00:00Z",
    "Title": "Running .NET Aspire on a local Kubernetes cluster",
    "Speaker": "Jorge Arteiro",
    "Description": "On this video, we are going to leverage all the power of .NET aspire and Kubernetes. Using Aspirate CLI, Kubernetes local cluster with Kind and Docker Desktop. We are going to deep dive into Kubernetes manifests and Helm charts. How about Debugging? we are going to use Mirrord open-source project to show you how debug your applications running on Kubernetes.",
    "DescriptionInZh": "在此视频中，我们将利用 .NET aspire 和 Kubernetes 的所有功能。使用 Aspirate CLI、具有 Kind 和 Docker Desktop 的 Kubernetes 本地集群。我们将深入研究 Kubernetes 清单和 Helm 图表。调试怎么样？我们将使用 Mirrord 开源项目来向您展示如何调试在 Kubernetes 上运行的应用程序。"
  },
  {
    "SessionId": 36,
    "BeginDateTime": "2024-11-14T04:00:00+00:00",
    "EndDateTime": "2024-11-14T04:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T12:00:00Z",
    "EndDateTimeInCST": "2024-11-14T12:30:00Z",
    "Title": "Spotify knows how you're feeling today ... via Semantic Kernel",
    "Speaker": "Justin Yoo",
    "Description": "You know your current mood, and you want to create a playlist on Spotify based on your current mood. But how does it catch how you're feeling now?\r\n\r\nThroughout this session, I'm going to discuss how Semantic Kernel seamlessly integrates OpenAI with existing codebase, and as a result, it will create a playlist based on the Billboard Top 100 chart, reflecting your current sentiment.",
    "DescriptionInZh": "您知道自己当前的心情，并且想根据自己当前的心情在 Spotify 上创建一个播放列表。但它如何捕捉您现在的感受呢？\r\n\r\n在本次会议中，我将讨论 Semantic Kernel 如何将 OpenAI 与现有代码库无缝集成，因此，它将根据 Billboard Top 100 图表创建一个播放列表，反映您当前的看法。"
  },
  {
    "SessionId": 37,
    "BeginDateTime": "2024-11-14T04:30:00+00:00",
    "EndDateTime": "2024-11-14T05:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T12:30:00Z",
    "EndDateTimeInCST": "2024-11-14T13:00:00Z",
    "Title": "Embedding Python libraries in .NET services and applications",
    "Speaker": "Anthony Shaw, Aaron Powell",
    "Description": "In this session we will bridge the gap between two powerful realms of development: .NET and Python. Discover the seamless integration of Python into .NET APIs and Services through an innovative new project that promises to revolutionize your workflow. We'll showcase a live demonstration of embedding essential AI and ML libraries such as scikit-learn and NumPy into a .NET Aspire application, revealing the untapped potential of end-to-end tracing for Enterprise development. This session is not just about observing; it's about engaging. We're eager to gather feedback, delve into diverse use cases, and share success stories from the community. Whether you're a seasoned developer or just starting, this is the perfect opportunity to expand your toolkit.",
    "DescriptionInZh": "在本次会议中，我们将弥合两个强大的开发领域之间的差距：.NET 和 Python。通过一个创新的新项目，探索 Python 与 .NET API 和服务的无缝集成，该项目有望彻底改变您的工作流程。我们将展示将基本 AI 和 ML 库（如 scikit-learn 和 NumPy）嵌入到 .NET Aspire 应用程序中的现场演示，揭示端到端跟踪在企业开发中尚未开发的潜力。本次会议不仅仅是关于观察;这是关于参与的。我们渴望收集反馈，深入研究各种用例，并分享社区的成功案例。无论您是经验丰富的开发人员还是刚刚起步，这都是扩展您的工具包的绝佳机会。"
  },
  {
    "SessionId": 38,
    "BeginDateTime": "2024-11-14T05:00:00+00:00",
    "EndDateTime": "2024-11-14T05:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T13:00:00Z",
    "EndDateTimeInCST": "2024-11-14T13:30:00Z",
    "Title": "Use .NET Aspire to create Generative AI Cloud Native Solutions",
    "Speaker": "Kinfey Lo",
    "Description": ".NET Aspire is a one-stop cloud-native distributed application solution. In this session, in the Generative AI scenario, you will use .NET Aspire combined with the Phi-3-mini ONNX model to quickly build RAG applications. You will learn\r\n \r\n1. How .NET Aspire structures GenAI applications\r\n2. Semantic Kernel creation skills\r\n3. Create RAG application through Phi-3-mini",
    "DescriptionInZh": ".NET Aspire 是一站式云原生分布式应用程序解决方案。在本次会议中，在生成式 AI 场景中，您将结合使用 .NET Aspire 和 Phi-3-mini ONNX 模型来快速构建 RAG 应用程序。您将学习\r\n \r\n1. .NET Aspire 如何构建 GenAI 应用程序\r\n2. 语义内核创建技巧\r\n3. 通过 Phi-3-mini 创建 RAG 应用程序"
  },
  {
    "SessionId": 39,
    "BeginDateTime": "2024-11-14T05:30:00+00:00",
    "EndDateTime": "2024-11-14T06:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T13:30:00Z",
    "EndDateTimeInCST": "2024-11-14T14:00:00Z",
    "Title": "Modernising Legacy .NET Codebases with NDepend",
    "Speaker": "Goh Chun Lin",
    "Description": "In this talk, we will explore how to migrate legacy .NET projects, such as O2DES.NET, which are still targeting at .NET Standard 2.1 to modern frameworks, focusing on the importance of code quality and maintainability. \r\n\r\nIn 2019, I had the honour of working closely with the team behind the open-source O2DES.NET during my time working at the C4NGP research center in National University of Singapore. After I left the team in 2022, O2DES.NET has not been actively updated on their GitHub public repository and it is still targeting at .NET Standard 2.1.\r\n\r\nThrough the example of updating O2DES.NET, we will demonstrate how static analysis tools like NDepend can help assess technical debt, visualise code dependencies, and guide us on code refactoring with the coding rules. \r\n\r\nWhether you are preparing for .NET 9 or optimising for current .NET versions, you will gain insights on how to future-proof your code for upcoming platform updates.",
    "DescriptionInZh": "在本次演讲中，我们将探讨如何将仍面向 .NET Standard 2.1 的旧版 .NET 项目（如 O2DES.NET）迁移到现代框架，重点关注代码质量和可维护性的重要性。\r\n\r\n2019 年，我有幸在新加坡国立大学 C4NGP 研究中心工作期间与开源 O2DES.NET 背后的团队密切合作。在我 2022 年离开团队后，O2DES.NET 尚未在其 GitHub 公共存储库上积极更新，它仍然面向 .NET Standard 2.1。\r\n\r\n通过更新 O2DES.NET 的示例，我们将演示像 NDepend 这样的静态分析工具如何帮助评估技术债务，可视化代码依赖关系，并指导我们使用编码规则重构代码。\r\n\r\n无论您是在准备 .NET 9 还是针对当前的 .NET 版本进行优化，您都将深入了解如何为即将到来的平台更新提供面向未来的代码。"
  },
  {
    "SessionId": 40,
    "BeginDateTime": "2024-11-14T06:00:00+00:00",
    "EndDateTime": "2024-11-14T06:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T14:00:00Z",
    "EndDateTimeInCST": "2024-11-14T14:30:00Z",
    "Title": "Navigating Async Challenges in EF Core for Large Data Retrieval",
    "Speaker": "Saeed Esmaeelinejad",
    "Description": "This talk will address a common yet critical issue faced by developers using EF Core (including EF Core 9.0) to read large datasets asynchronously. Despite the promise of scalability with async programming, many encounter performance degradation, timeouts, or incomplete data reads when using methods like ToListAsync and FirstOrDefaultAsync in EF Core.\r\n\r\nWe'll examine the underlying SqlClient library and its internal class, TdsParserStateObject, to understand how it handles asynchronous operations and why it struggles with large data reads. Attendees will gain insights into EF Core's async behavior, potential workarounds, and strategies to optimize performance when working with large datasets.",
    "DescriptionInZh": "本次演讲将解决开发人员使用 EF Core（包括 EF Core 9.0）异步读取大型数据集时面临的一个常见但关键的问题。尽管异步编程有望实现可伸缩性，但在 EF Core 中使用 ToListAsync 和 FirstOrDefaultAsync 等方法时，许多人会遇到性能下降、超时或数据读取不完整的情况。\r\n\r\n我们将研究底层的 SqlClient 库及其内部类 TdsParserStateObject，以了解它如何处理异步操作以及为什么它在处理大数据读取时遇到困难。与会者将深入了解 EF Core 的异步行为、可能的解决方法和策略，以便在使用大型数据集时优化性能。"
  },
  {
    "SessionId": 41,
    "BeginDateTime": "2024-11-14T06:30:00+00:00",
    "EndDateTime": "2024-11-14T07:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T14:30:00Z",
    "EndDateTimeInCST": "2024-11-14T15:00:00Z",
    "Title": "With .NET and AI, our community app \"aspires\" to be on cloud nine",
    "Speaker": "Augustine Correa",
    "Description": "We are the largest Open-Source Software [OSS] community with its longest running (> 10 years) tech meetup in Bombay.\r\n\r\nAnd as such we are mostly houseful [\r\nhttps://x.com/search?q=learnAspireMumbai&src=typed_query&f=live]. As a community that is committed to diversity and inclusiveness, most of our efforts and time is expended on registration triaging. And the next biggest friction in our meetup management is to ensure attendee check-ins and check-outs for building/civic code adherence\r\n\r\nSo as a tech community, to solve this, we did the only thing we love to do: build an app. That too on .NET 9. We will tell you why .net9 is the best .NET yet and share what are the gotchas we had to look out for.\r\n\r\nIn this session, we will explore the development of our community app using the latest features of .NET 9: Aspire, Semantic Kernel, Blazor Hybrid. This app leverages the power of .NET 9 to create a cloud-native, and intelligent platform that enhances user engagement and community interaction. We will delve into the integration of AI models to provide personalized experiences and improve overall functionality to building an inclusive and diverse community\r\n\r\nAlso, our demo would include how GitHub Copilot and Copilot Workspace turbo charged our development to debut the app in time for .NET Conf 2024.\r\n \r\nAnd we wouldn't be an OSS community, if it's not on GitHub [https://github.com/HackerspaceMumbai/Visage/tree/dotnet9]. Contributors welcome 🙏",
    "DescriptionInZh": "我们是最大的开源软件 [OSS] 社区，在孟买举办时间最长（> 10 年）的技术聚会。\r\n\r\n因此，我们大部分时间都是无家可归的 [\r\nhttps://x.com/search?q=learnAspireMumbai&src=typed_query&f=live]。作为一个致力于多元化和包容性的社区，我们的大部分精力和时间都花在了注册分类上。我们聚会管理中的下一个最大摩擦是确保与会者签到和签到以遵守建筑/公民法规\r\n\r\n因此，作为一个技术社区，为了解决这个问题，我们做了我们唯一喜欢做的事情：构建一个应用程序。在 .NET 9 上也是如此。我们将告诉您为什么 .net9 是迄今为止最好的 .NET，并分享我们必须注意的问题。\r\n\r\n在本次会议中，我们将探索如何使用 .NET 9 的最新功能开发我们的社区应用程序：Aspire、Semantic Kernel、Blazor Hybrid。此应用程序利用 .NET 9 的强大功能来创建一个云原生智能平台，以增强用户参与度和社区互动。我们将深入研究 AI 模型的集成，以提供个性化的体验并改进整体功能，以构建一个包容和多元化的社区\r\n\r\n此外，我们的演示还将包括 GitHub Copilot 和 Copilot Workspace 如何加速我们的开发，以便在 .NET Conf 2024 上及时推出该应用程序。\r\n \r\n如果不在 GitHub 上 [https://github.com/HackerspaceMumbai/Visage/tree/dotnet9] ，我们就不会成为一个 OSS 社区。欢迎🙏贡献者"
  },
  {
    "SessionId": 42,
    "BeginDateTime": "2024-11-14T07:00:00+00:00",
    "EndDateTime": "2024-11-14T07:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T15:00:00Z",
    "EndDateTimeInCST": "2024-11-14T15:30:00Z",
    "Title": "Building Modular Monolith Applications with ASP.NET Core and ABP Studio",
    "Speaker": "Halil İbrahim Kalkan",
    "Description": "ABP is an open source application development framework for .NET Developers. One of its main goals is to enable you to create modular applications. With the new ABP Studio tool, it is now easier to create fully modular systems with ASP.NET Core.\r\nIn this talk, I will show how to do it in practical and explain the benefits of that approach.",
    "DescriptionInZh": "ABP 是面向 .NET 开发人员的开源应用程序开发框架。它的主要目标之一是使您能够创建模块化应用程序。借助新的 ABP Studio 工具，现在可以更轻松地使用 ASP.NET Core 创建完全模块化的系统。\r\n在本次演讲中，我将展示如何在实践中做到这一点，并解释这种方法的好处。"
  },
  {
    "SessionId": 43,
    "BeginDateTime": "2024-11-14T07:30:00+00:00",
    "EndDateTime": "2024-11-14T08:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T15:30:00Z",
    "EndDateTimeInCST": "2024-11-14T16:00:00Z",
    "Title": "From error to fixes:Adding recoverability to MassTransit - based systems",
    "Speaker": "Irina Dominte(Scurtu)",
    "Description": "In distributed systems, failures and errors are inevitable. Often, even after several automatic retries, messages can't be processed and end up in error queues. What then?\r\n\r\nYou will require some message broker knowledge to reprocess them, and manually extract them from the queues, but these are some reasons you use an abstraction like MassTransit. To not need that.\r\n\r\nThis session uses Aspire and ServiceControl to provide a practical approach to seamlessly adding *replayability* to MassTransit-based systems.",
    "DescriptionInZh": "在分布式系统中，故障和错误是不可避免的。通常，即使经过多次自动重试，消息也无法处理，最终进入错误队列。那又如何呢？\r\n\r\n您将需要一些消息代理知识来重新处理它们，并从队列中手动提取它们，但这些是您使用像 MassTransit 这样的抽象的一些原因。不需要那个。\r\n\r\n本次会议使用 Aspire 和 ServiceControl 提供一种实用的方法，将 *可重玩性* 无缝添加到基于 MassTransit 的系统中。"
  },
  {
    "SessionId": 44,
    "BeginDateTime": "2024-11-14T08:00:00+00:00",
    "EndDateTime": "2024-11-14T08:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T16:00:00Z",
    "EndDateTimeInCST": "2024-11-14T16:30:00Z",
    "Title": "Releasing HybridCache into the Wild with Umbraco",
    "Speaker": "Emma Burstow, Lotte Pitcher",
    "Description": "In November 2024, Microsoft will unveil the highly anticipated hybrid cache feature, and at Umbraco, we couldn't be more excited. Our close alignment with Microsoft’s release cadence allows us to strategically incorporate the latest MS roadmap features such as tag-based eviction and the new MapStaticAssets middleware into our sprint planning. We’d like to show that on this occasion, the hybrid cache and other features have provided us with a unique opportunity to innovate.\r\n\r\nJoin Emma and Lotte as they take you through Umbraco’s development in sync with Microsoft’s vision. They will showcase how our approach has enabled us to swiftly integrate cutting-edge capabilities, culminating in the implementation of the latest features in .NET 9. Discover how Umbraco’s agile alignment with Microsoft’s evolving technology landscape drives forward-thinking solutions that keep us ahead of the curve.",
    "DescriptionInZh": "2024 年 11 月，Microsoft 将推出备受期待的混合缓存功能，在 Umbraco 上，我们感到无比兴奋。我们与 Microsoft 的发布节奏紧密一致，这使我们能够战略性地将最新的 MS 路线图功能（例如基于标签的逐出和新的 MapStaticAssets 中间件）整合到我们的冲刺计划中。我们想表明，在这种情况下，混合缓存和其他功能为我们提供了独特的创新机会。\r\n\r\n加入 Emma 和 Lotte 的行列，他们将带您了解 Umbraco 与 Microsoft 愿景同步的开发过程。他们将展示我们的方法如何使我们能够快速集成尖端功能，最终在 .NET 9 中实现最新功能。了解 Umbraco 如何与 Microsoft 不断发展的技术环境实现敏捷结合，推动前瞻性解决方案，使我们保持领先地位。"
  },
  {
    "SessionId": 45,
    "BeginDateTime": "2024-11-14T08:30:00+00:00",
    "EndDateTime": "2024-11-14T09:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T16:30:00Z",
    "EndDateTimeInCST": "2024-11-14T17:00:00Z",
    "Title": "F# - Nullable Reference Types",
    "Speaker": "Tomáš Grošup",
    "Description": "Join us for an in-depth exploration of F# 9's highly anticipated Nullable Reference Types feature. After years of development and strong community demand, this feature is set to revolutionize how F# handles null values, making C#-F# interop smoother and bringing a new level of null safety to the language. \r\n\r\nWhether you're an F# enthusiast or a C# developer looking to leverage F#'s strengths, this talk will equip you with the knowledge to take full advantage of this new feature.",
    "DescriptionInZh": "加入我们，深入了解 F# 9 备受期待的可为 Null 引用类型功能。经过多年的开发和强大的社区需求，此功能将彻底改变 F# 处理 null 值的方式，使 C#-F# 互操作更加顺畅，并为语言带来新的空安全级别。\r\n\r\n无论您是 F# 爱好者还是希望利用 F# 优势的 C# 开发人员，本次讲座都将为您提供充分利用此新功能的知识。"
  },
  {
    "SessionId": 46,
    "BeginDateTime": "2024-11-14T09:00:00+00:00",
    "EndDateTime": "2024-11-14T09:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T17:00:00Z",
    "EndDateTimeInCST": "2024-11-14T17:30:00Z",
    "Title": "C# Source Generators Boost Productivity in the Rx.NET Repo",
    "Speaker": "Ian Griffiths",
    "Description": "Code generation has become increasingly important in recent versions of .NET, especially when using AOT compilation. But they can also play a role in boosting your power as a developer.\r\n\r\nThis talk will show how we've been using source generators to extend the reach of the test suite in the Reactive Extensions for .NET. AsyncRx.NET was an experimental project with no tests, but source generators have made it possible to make the existing Rx.NET test suite work in this new project.",
    "DescriptionInZh": "在最新版本的 .NET 中，代码生成变得越来越重要，尤其是在使用 AOT 编译时。但它们也可以在提升您作为开发人员的能力方面发挥作用。\r\n\r\n本次演讲将展示我们如何使用 Source Generator 来扩展 Reactive Extensions for .NET 中测试套件的覆盖范围。AsyncRx.NET 是一个没有测试的实验项目，但源生成器使现有的 Rx.NET 测试套件在这个新项目中工作成为可能。"
  },
  {
    "SessionId": 47,
    "BeginDateTime": "2024-11-14T09:30:00+00:00",
    "EndDateTime": "2024-11-14T10:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T17:30:00Z",
    "EndDateTimeInCST": "2024-11-14T18:00:00Z",
    "Title": "Advanced Pattern Matching in C#",
    "Speaker": "Oliver Sturm",
    "Description": "All \"real\" functional languages support Pattern Matching - that's not really true, but it is correct that aspects of a functional programming style benefit from elegant and syntactically compact case distinction. Microsoft worked on Pattern Matching as a C# feature in at least three major language versions! In this talk, Oliver demonstrates how C# Pattern Matching works, why this evolution of the old imperative \"switch\" is so important, and how the structure of C# Code can be generally different from the past on the basis of this feature. As a conclusion, he proves that C# can now pattern match with the best, by porting a complex piece of Haskell code.",
    "DescriptionInZh": "所有 “真正的” 函数式语言都支持 Pattern Matching - 这并不是真的，但函数式编程风格的各个方面受益于优雅且语法紧凑的大小写区分是正确的。Microsoft 在至少三个主要语言版本中将模式匹配作为 C# 功能进行开发！在本次演讲中，Oliver 演示了 C# 模式匹配的工作原理，为什么旧的命令式“开关”的演变如此重要，以及基于此功能的 C# 代码结构通常如何与过去不同。总而言之，他证明了 C# 现在可以通过移植一段复杂的 Haskell 代码来与最好的代码进行模式匹配。"
  },
  {
    "SessionId": 48,
    "BeginDateTime": "2024-11-14T10:00:00+00:00",
    "EndDateTime": "2024-11-14T10:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T18:00:00Z",
    "EndDateTimeInCST": "2024-11-14T18:30:00Z",
    "Title": "Bulletproof ASP.NET Core APIs: The OWASP API Security Top Ten",
    "Speaker": "Christian Wenz",
    "Description": "The OWASP Top Ten as a list of the ten biggest security risks for web applications has been a de facto standard for over ten years. Somewhat out of the limelight, however, there are other lists. The OWASP API Security Top Ten highlights risks for APIs. Since arguably almost every web application relies on APIs these days, it's imperative that we address them. In the talk, we'll take a look at how the list came about and then go through all the points. In particular, we are of course interested in what this means for our chosen stack ASP.NET Core. Which points are relevant, and how can we take technology-specific countermeasures?",
    "DescriptionInZh": "OWASP Top Ten 作为 Web 应用程序的十大安全风险列表，十多年来一直是事实上的标准。然而，在某种程度上，还有其他列表。OWASP API 安全十大突出了 API 面临的风险。由于可以说现在几乎每个 Web 应用程序都依赖于 API，因此我们必须解决它们。在演讲中，我们将了解该列表是如何产生的，然后介绍所有要点。特别是，我们当然对这对我们选择的 ASP.NET Core 堆栈意味着什么感兴趣。哪些点是相关的，我们如何采取特定于技术的对策？"
  },
  {
    "SessionId": 49,
    "BeginDateTime": "2024-11-14T10:30:00+00:00",
    "EndDateTime": "2024-11-14T11:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T18:30:00Z",
    "EndDateTimeInCST": "2024-11-14T19:00:00Z",
    "Title": "Accessibility as a concept",
    "Speaker": "Jemima Abu",
    "Description": "Knowing how to build accessible products is important but it's just as important to know why we build products to be accessible. Basic human decency aside, there's a plethora of reasons for building products that everyone can use. In this talk, we'll explore the concept of accessibility in order to better understand its necessity and the ramifications involved in building non accessible products. We'll also answer pressing questions like \"How do I know if this thing I built is accessible?\" and \"Whose job is it to ensure accessibility?\" (Spoiler: it's everyone's job)",
    "DescriptionInZh": "知道如何构建无障碍产品很重要，但了解我们为什么构建无障碍产品也同样重要。撇开基本的人类尊严不谈，构建每个人都可以使用的产品有很多理由。在本次演讲中，我们将探讨辅助功能的概念，以便更好地理解其必要性以及构建非辅助功能产品所涉及的后果。我们还将回答一些紧迫的问题，例如“我怎么知道我构建的这个东西是否无障碍”和“谁的工作是确保无障碍？（剧透：这是每个人的工作）"
  },
  {
    "SessionId": 50,
    "BeginDateTime": "2024-11-14T11:00:00+00:00",
    "EndDateTime": "2024-11-14T11:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T19:00:00Z",
    "EndDateTimeInCST": "2024-11-14T19:30:00Z",
    "Title": "Building Rich Web Applications with Blazor Server and MudBlazor",
    "Speaker": "Flora Mousavi",
    "Description": "In this session, we'll explore how to create robust, interactive web applications using Blazor Server and MudBlazor. We'll dive into practical examples from a real-world application, discussing how MudBlazor's rich components can enhance user experience and simplify development. The session will cover performance optimization techniques, handling complex UI requirements, and best practices for deploying Blazor Server apps in production. Attendees will leave with actionable insights to elevate their Blazor Server projects.",
    "DescriptionInZh": "在本次会议中，我们将探讨如何使用 Blazor Server 和 MudBlazor 创建可靠的交互式 Web 应用程序。我们将深入研究实际应用程序中的实际示例，讨论 MudBlazor 的丰富组件如何增强用户体验并简化开发。该会议将介绍性能优化技术、处理复杂的 UI 要求以及在生产环境中部署 Blazor Server 应用的最佳做法。与会者将获得可操作的见解，以提升他们的 Blazor Server 项目。"
  },
  {
    "SessionId": 51,
    "BeginDateTime": "2024-11-14T11:30:00+00:00",
    "EndDateTime": "2024-11-14T12:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T19:30:00Z",
    "EndDateTimeInCST": "2024-11-14T20:00:00Z",
    "Title": "Building Generative AI apps with GitHub Models and .NET",
    "Speaker": "April Yoho",
    "Description": "As a full stack engineer, we often are integrating our code with various AI models. As access to models has been a challenge, you can now customize and are given a free playground with GitHub Models.\r\n\r\nIn this session we'll dive into how to choose an AI model, configure the parameters and most importantly learn about prompting with AI. April will be providing a hands-on session to being AI to your engineering practices",
    "DescriptionInZh": "作为全栈工程师，我们经常将我们的代码与各种 AI 模型集成。由于访问模型一直是一项挑战，您现在可以自定义并获得 GitHub Models 的免费 Playground。\r\n\r\n在本次会议中，我们将深入探讨如何选择 AI 模型、配置参数，最重要的是了解如何使用 AI 进行提示。April 将提供一个实践会议，将 AI 融入您的工程实践"
  },
  {
    "SessionId": 52,
    "BeginDateTime": "2024-11-14T12:00:00+00:00",
    "EndDateTime": "2024-11-14T12:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T20:00:00Z",
    "EndDateTimeInCST": "2024-11-14T20:30:00Z",
    "Title": "Empowering WPF Developers: A Journey Through .NET 9 and the Road Ahead",
    "Speaker": "Pankaj Chaurasia",
    "Description": "Join us on a journey through the latest advancements in WPF with .NET 9 and explore the exciting future that lies ahead. This talk will dive deep into the new Fluent theme, which brings a modern Windows 11 look and feel to WPF applications, complete with Light/Dark mode and system accent color support. We'll also cover the new hyphen-based ligature support that enhances typography for a more polished user experience. But that's not all—get a sneak peek into what's planned for beyond .NET 10, including the top-requested features that will empower you to build even more powerful and visually stunning WPF applications. Whether you're a seasoned WPF developer or just getting started, this session will equip you with the knowledge and tools to take full advantage of the platform's evolving capabilities.",
    "DescriptionInZh": "加入我们，了解 WPF 与 .NET 9 的最新进展，并探索未来令人兴奋的未来。本次演讲将深入探讨新的 Fluent 主题，该主题为 WPF 应用程序带来了现代的 Windows 11 外观，并配有浅色/深色模式和系统主题色支持。我们还将介绍新的基于连字符的连字支持，该支持可增强排版，从而提供更精致的用户体验。但这还不是全部 - 抢先了解 .NET 10 之后的计划，包括最需要的功能，这些功能将使您能够构建更强大、视觉上更令人惊叹的 WPF 应用程序。无论您是经验丰富的 WPF 开发人员还是新手，本次会议都将为您提供知识和工具，以充分利用平台不断发展的功能。"
  },
  {
    "SessionId": 53,
    "BeginDateTime": "2024-11-14T12:30:00+00:00",
    "EndDateTime": "2024-11-14T13:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T20:30:00Z",
    "EndDateTimeInCST": "2024-11-14T21:00:00Z",
    "Title": "WPF Reborn: Avalonia's Cross-Platform Magic",
    "Speaker": "Mike James",
    "Description": "Step into the future of .NET app development! \r\n\r\nThis hands-on session will revolutionise the way you think about WPF applications. We're ditching the slides and diving straight into the IDE to show you how Avalonia and Avalonia XPF can breathe new life into your Windows-only apps.\r\n\r\nYou'll leave with the knowledge to take your desktop apps cross-platform, opening up new markets and opportunities.",
    "DescriptionInZh": "步入 .NET 应用程序开发的未来！\r\n\r\n此实践课程将彻底改变您对 WPF 应用程序的看法。我们将放弃幻灯片，直接进入 IDE，向您展示 Avalonia 和 Avalonia XPF 如何为仅限 Windows 的应用程序注入新的活力。\r\n\r\n您将获得跨平台桌面应用程序、开辟新市场和机会的知识。"
  },
  {
    "SessionId": 54,
    "BeginDateTime": "2024-11-14T13:00:00+00:00",
    "EndDateTime": "2024-11-14T13:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T21:00:00Z",
    "EndDateTimeInCST": "2024-11-14T21:30:00Z",
    "Title": "Talking to managers about modernizing .NET apps",
    "Speaker": "Tomas Herceg",
    "Description": "Most developers understand the benefits of migrating legacy apps to the new .NET and the risks of not doing so. Sadly, it is usually not the developers who decide whether these old .NET Framework applications will be modernized or not. \r\nHow do you convince the management to allocate the budget for this task? What arguments and information should you present to stakeholders who do not have a technical background to ensure they understand the situation?\r\nIn this session, I'll provide valuable tips and arguments I used in the past to advocate the necessity of modernization in various companies. I'll talk about estimating the effort of modernization and the long-term maintenance costs. I'll also go through the security risks and other benefits of the upgrade, such as improving the project's attractiveness for hiring new developers.",
    "DescriptionInZh": "大多数开发人员都了解将旧应用程序迁移到新 .NET 的好处，以及不这样做的风险。遗憾的是，通常不是开发人员决定这些旧的 .NET Framework 应用程序是否要现代化。\r\n您如何说服管理层为这项任务分配预算？您应该向没有技术背景的利益相关者提供哪些论点和信息，以确保他们了解情况？\r\n在本次会议中，我将提供我过去使用的宝贵提示和论点，以倡导各种公司现代化的必要性。我将讨论如何估算现代化的工作量和长期维护成本。我还将介绍升级的安全风险和其他好处，例如提高项目对雇用新开发人员的吸引力。"
  },
  {
    "SessionId": 55,
    "BeginDateTime": "2024-11-14T13:30:00+00:00",
    "EndDateTime": "2024-11-14T14:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T21:30:00Z",
    "EndDateTimeInCST": "2024-11-14T22:00:00Z",
    "Title": "Azure Health Checks in .NET 9",
    "Speaker": "Steven Hook",
    "Description": "Join us for an exploration of how Azure’s Health Check feature, integrated with .NET 9 APIs, can provide base-level or even customized validation of your application’s health. We'll also be covering some lessons learned from production systems and some surprising results of misconfigured health checks. At first glace, health checks are rather simple but determining what to check and what Azure does with applications that fail those checks is critical to understand before implementing a health check.\r\n\r\nTopics to cover:\r\n- Setting up a simple health check to ensure the app service exists\r\n- Customizing your health check to validate dependencies\r\n- Discussing some secrets of how Azure recovers from an unhealth app\r\n- Advanced customizations to have more control of failovers and frequency",
    "DescriptionInZh": "加入我们，探索 Azure 的运行状况检查功能如何与 .NET 9 API 集成，提供应用程序运行状况的基本级别甚至自定义验证。我们还将介绍从生产系统中吸取的一些经验教训，以及配置错误的运行状况检查的一些令人惊讶的结果。乍一看，运行状况检查相当简单，但在实施运行状况检查之前，了解要检查的内容以及 Azure 如何处理未通过这些检查的应用程序至关重要。\r\n\r\n要涵盖的主题：\r\n- 设置简单的运行状况检查以确保应用服务存在\r\n- 自定义运行状况检查以验证依赖项\r\n- 讨论 Azure 如何从不健康的应用中恢复的一些秘密\r\n- 高级自定义，以更好地控制故障转移和频率"
  },
  {
    "SessionId": 56,
    "BeginDateTime": "2024-11-14T14:00:00+00:00",
    "EndDateTime": "2024-11-14T14:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T22:00:00Z",
    "EndDateTimeInCST": "2024-11-14T22:30:00Z",
    "Title": "Migrate your .NET Framework / EF6 \"Classic\" app to .NET 9 and Azure SQL",
    "Speaker": "Erik Ejlskov Jensen",
    "Description": "With the help of a new Entity Framework 6 \"Classic\" package thjat I have just published, you can migrate your legacy .NET Framework applications in increments and move to .NET 9 with Azure SQL Database and the latest security advances. In this demo driven session you will learn how to do this with the help of .NET Upgrade Assistant and my new package.",
    "DescriptionInZh": "借助我刚刚发布的新 Entity Framework 6“经典”包，您可以逐步迁移旧版 .NET Framework 应用程序，并使用 Azure SQL 数据库和最新的安全进步迁移到 .NET 9。在此演示驱动的会话中，您将学习如何在 .NET Upgrade Assistant 和我的新程序包的帮助下执行此操作。"
  },
  {
    "SessionId": 57,
    "BeginDateTime": "2024-11-14T14:30:00+00:00",
    "EndDateTime": "2024-11-14T15:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T22:30:00Z",
    "EndDateTimeInCST": "2024-11-14T23:00:00Z",
    "Title": "dotnet CLI all the things!",
    "Speaker": "Andres Pineda",
    "Description": "Visual Studio is undoubtedly an excellent IDE that makes us highly productive in building applications, offering the best experience for .NET development. But what if you could remain productive even when Visual Studio isn't available?\r\n\r\nIn this presentation, we'll dive into the capabilities of the .NET CLI, equipping you with everything you need to build, run, and deploy all types of .NET applications.",
    "DescriptionInZh": "Visual Studio 无疑是一个出色的 IDE，它使我们在构建应用程序方面非常高效，为 .NET 开发提供最佳体验。但是，如果即使 Visual Studio 不可用，您也可以保持高效，那会怎样呢？\r\n\r\n在本演示中，我们将深入探讨 .NET CLI 的功能，为您提供构建、运行和部署所有类型的 .NET 应用程序所需的一切。"
  },
  {
    "SessionId": 58,
    "BeginDateTime": "2024-11-14T15:00:00+00:00",
    "EndDateTime": "2024-11-14T15:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T23:00:00Z",
    "EndDateTimeInCST": "2024-11-14T23:30:00Z",
    "Title": "From Monolith Towards Microservices: EventStorming as Your Modernization Blueprint",
    "Speaker": "Sarah Dutkiewicz",
    "Description": "Modernizing legacy monoliths is a daunting task, but EventStorming offers a clear path forward. Join us as we show how you can use EventStorming to deconstruct your monolithic .NET applications and migrate them towards a microservices architecture. This session will provide actionable insights into the EventStorming process, highlighting how it helps align technical and business teams while reducing risks and ensuring a smooth transition.",
    "DescriptionInZh": "对传统单体式架构进行现代化改造是一项艰巨的任务，但 EventStorming 提供了一条明确的前进道路。加入我们，我们将展示如何使用 EventStorming 解构整体式 .NET 应用程序并将其迁移到微服务架构。本次会议将提供对 EventStorming 流程的可行见解，重点介绍它如何帮助协调技术和业务团队，同时降低风险并确保平稳过渡。"
  },
  {
    "SessionId": 59,
    "BeginDateTime": "2024-11-14T15:30:00+00:00",
    "EndDateTime": "2024-11-14T16:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-14T23:30:00Z",
    "EndDateTimeInCST": "2024-11-15T00:00:00Z",
    "Title": "Building Microservices with .NET 9: Integrating AI for Smarter, Scalable Applications",
    "Speaker": "Rebai Hamida",
    "Description": "As microservices continue to dominate the architecture landscape, integrating AI capabilities into these services can lead to smarter and more responsive applications. In this session, we'll explore:\r\nHow to architect microservices with .NET 9, focusing on modularity, scalability, and maintainability.\r\nThe process of embedding AI into these microservices using Azure OpenAI, enhancing their functionality with intelligent decision-making.\r\nStrategies for deploying and managing these AI-powered microservices in a containerized environment using Docker, ensuring they are cloud-ready.",
    "DescriptionInZh": "随着微服务继续在架构领域占据主导地位，将 AI 功能集成到这些服务中可以带来更智能、响应速度更快的应用程序。在本次会议中，我们将探讨：\r\n如何使用 .NET 9 构建微服务，重点关注模块化、可伸缩性和可维护性。\r\n使用 Azure OpenAI 将 AI 嵌入到这些微服务中，通过智能决策增强其功能的过程。\r\n使用 Docker 在容器化环境中部署和管理这些 AI 驱动的微服务的策略，确保它们可用于云。"
  },
  {
    "SessionId": 60,
    "BeginDateTime": "2024-11-14T16:00:00+00:00",
    "EndDateTime": "2024-11-14T16:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T00:00:00Z",
    "EndDateTimeInCST": "2024-11-15T00:30:00Z",
    "Title": "How I used .NET 9 and AI to charge my electric car based on the available solar power",
    "Speaker": "Johnny Hooyberghs",
    "Description": "Can you use .NET 9 to charge your electric car using solar power? Absolutely!\r\nIn this session, Johnny will show you how to leverage your development skills and .NET 9 to combine data from external vendors by using their API's and be smart with that data to command your electric vehicle to charge when the time is right.\r\nJohnny even added some AI to the mix to be able to ask questions about the current charging state using Azure OpenAI for the LLM, Semantic Kernel to create a custom copilot, and Azure Cognitive Services for Speech-To-Text.\r\nThis demo is not something that is put together for this talk, it is a cloud-native distributed application used by Johnny on a day-to-day basis.",
    "DescriptionInZh": "您可以使用 .NET 9 通过太阳能为您的电动汽车充电吗？绝对！\r\n在本次会议中，Johnny 将向您展示如何利用您的开发技能和 .NET 9 通过使用外部供应商的 API 来组合来自外部供应商的数据，并巧妙地使用这些数据来命令您的电动汽车在适当的时候充电。\r\nJohnny 甚至添加了一些 AI，以便能够使用适用于 LLM 的 Azure OpenAI、用于创建自定义副驾驶的语义内核以及用于语音转文本的 Azure 认知服务来询问有关当前充电状态的问题。\r\n这个演示不是为本次演讲而准备的，它是 Johnny 日常使用的云原生分布式应用程序。"
  },
  {
    "SessionId": 61,
    "BeginDateTime": "2024-11-14T16:30:00+00:00",
    "EndDateTime": "2024-11-14T17:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T00:30:00Z",
    "EndDateTimeInCST": "2024-11-15T01:00:00Z",
    "Title": "Getting Started with OpenTelemetry in .NET",
    "Speaker": "Frank Boucher, Jason Hand",
    "Description": "In this session, we will show you how to instrument a .NET Blazor application to use OpenTelemetry and .NET Aspire to help us visualize what is really happening in our application. We will than see how we can add OpenTelemetry exporters and use different solution: Azure Application Insight or Datadog APM to collect those OpenTelemetry metrics and traces and how it could help us.",
    "DescriptionInZh": "在本次会议中，我们将向你展示如何检测 .NET Blazor 应用程序以使用 OpenTelemetry 和 .NET Aspire 来帮助我们可视化应用程序中实际发生的情况。接下来，我们将了解如何添加 OpenTelemetry 导出器并使用不同的解决方案：Azure Application Insight 或 Datadog APM 来收集这些 OpenTelemetry 指标和跟踪，以及它如何帮助我们。"
  },
  {
    "SessionId": 62,
    "BeginDateTime": "2024-11-14T17:00:00+00:00",
    "EndDateTime": "2024-11-14T17:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T01:00:00Z",
    "EndDateTimeInCST": "2024-11-15T01:30:00Z",
    "Title": "New tools in Visual Studio for Web API developers",
    "Speaker": "Sayed Hashimi",
    "Description": "There's so much new good stuff in Visual Studio for ASP.NET Core Web API developers. We've added lots of features to HTTP files and we are making it easier for you to develop Web APIs. Sayed will give a tour of all the new features and support for Web API developers.",
    "DescriptionInZh": "Visual Studio 中为 ASP.NET Core Web API 开发人员提供了许多新的好东西。我们为 HTTP 文件添加了许多功能，让您可以更轻松地开发 Web API。Sayed 将介绍面向 Web API 开发人员的所有新功能和支持。"
  },
  {
    "SessionId": 63,
    "BeginDateTime": "2024-11-14T17:30:00+00:00",
    "EndDateTime": "2024-11-14T18:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T01:30:00Z",
    "EndDateTimeInCST": "2024-11-15T02:00:00Z",
    "Title": "Extending ASP.NET Core OpenAPI - Enrich your OpenAPI documents with examples, descriptions and more!",
    "Speaker": "Martin Costello",
    "Description": "In this session we'll take a look into the transformation interfaces that ship as part of the Microsoft.AspNetCore.OpenApi NuGet package in ASP.NET Core 9 to see how we can build on top of them to enrich an OpenAPI document.\r\n\r\nUsing document, operation and schema transformers, we'll take a look at an approach to add rich examples and descriptions to an API to help make it even easier for other developers to create an integration that depends on our application's API.",
    "DescriptionInZh": "在本会话中，我们将了解作为 ASP.NET Core 9 中 Microsoft.AspNetCore.OpenApi NuGet 包的一部分提供的转换接口，以了解我们如何基于这些接口进行构建以丰富 OpenAPI 文档。\r\n\r\n使用文档、操作和架构转换器，我们将研究一种向 API 添加丰富示例和描述的方法，以帮助其他开发人员更轻松地创建依赖于我们应用程序 API 的集成。"
  },
  {
    "SessionId": 64,
    "BeginDateTime": "2024-11-14T18:00:00+00:00",
    "EndDateTime": "2024-11-14T18:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T02:00:00Z",
    "EndDateTimeInCST": "2024-11-15T02:30:00Z",
    "Title": "Clean Architecture with ASP.NET Core 9",
    "Speaker": "Steve Smith",
    "Description": "ASP.NET Core 9 provides better support for clean, testable, maintainable architectures than any of its predecessors. Learn the underlying principles that apply to project/solution organization, how best to arrange your projects to support clean code, and how to refactor existing solutions toward this architecture. Examples will use ASP.NET Core but the principles covered apply to all languages and platforms.",
    "DescriptionInZh": "ASP.NET Core 9 比其任何前代产品都更好地支持干净、可测试、可维护的架构。了解适用于项目/解决方案组织的基本原则，如何最好地安排项目以支持干净的代码，以及如何将现有解决方案重构到此体系结构。示例将使用 ASP.NET Core，但所涵盖的原则适用于所有语言和平台。"
  },
  {
    "SessionId": 65,
    "BeginDateTime": "2024-11-14T19:00:00+00:00",
    "EndDateTime": "2024-11-14T19:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T03:00:00Z",
    "EndDateTimeInCST": "2024-11-15T03:30:00Z",
    "Title": "Community Toolkit Roundup",
    "Speaker": "Gerald Versluis, Michael Hawker, Adrian Hall",
    "Description": "The past year the Community Toolkit family has been growing, and we've welcomed the .NET Aspire Toolkit and Datasync Toolkit. So it's about time we update you with the latest and greatest.\r\n\r\nJoin a lively discussion with maintainers of the Community Toolkits, the .NET Community Toolkit, the MAUI Community Toolkit, and the Windows Community Toolkit. Learn about these open-source projects which aim to provide useful and high-quality components, controls, and utilities for .NET developers.\r\n\r\nDiscover how you can get involved, contribute, and benefit from these amazing toolkits that cover various .NET platforms and technologies. Whether you are developing desktop, mobile, web, or cross-platform applications, there is a Toolkit for you!",
    "DescriptionInZh": "在过去的一年里，Community Toolkit 系列不断壮大，我们迎来了 .NET Aspire Toolkit 和 Datasync Toolkit。因此，现在是时候为您提供最新和最好的更新了。\r\n\r\n加入与社区工具包、.NET 社区工具包、MAUI 社区工具包和 Windows 社区工具包的维护者的热烈讨论。了解这些开源项目，这些项目旨在为 .NET 开发人员提供有用的高质量组件、控件和实用程序。\r\n\r\n了解如何参与、贡献这些涵盖各种 .NET 平台和技术的出色工具包并从中受益。无论您是开发桌面、移动、Web 还是跨平台应用程序，总有一款 Toolkit 适合您！"
  },
  {
    "SessionId": 66,
    "BeginDateTime": "2024-11-14T19:30:00+00:00",
    "EndDateTime": "2024-11-14T20:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T03:30:00Z",
    "EndDateTimeInCST": "2024-11-15T04:00:00Z",
    "Title": "State of the .NET Foundation and .NET Open Source",
    "Speaker": "Kevin Griffin, Mitchel Sellers",
    "Description": "We discuss the .NET Foundation's current state, what we'd like to do moving forward, and how the .NET community can get involved. We also highlight some new projects recently added to the Foundation.",
    "DescriptionInZh": "我们将讨论 .NET Foundation 的当前状态、我们未来想要做什么以及 .NET 社区如何参与。我们还重点介绍了最近添加到基金会的一些新项目。"
  },
  {
    "SessionId": 67,
    "BeginDateTime": "2024-11-14T20:00:00+00:00",
    "EndDateTime": "2024-11-14T20:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T04:00:00Z",
    "EndDateTimeInCST": "2024-11-15T04:30:00Z",
    "Title": "Building .NET Applications with .NET Aspire and AWS",
    "Speaker": "Norm Johanson",
    "Description": "Aspire, the .NET Cloud Native development platform is a multi cloud development platform. This session you will learn how you can use Aspire to integrate AWS into your development environment. The combined integration of Aspire and AWS can remove the need for collection of tools to a simple F5 debug session that starts your application with all of AWS resources provisioned and connected to your application.",
    "DescriptionInZh": "Aspire 是 .NET Cloud Native 开发平台，是一个多云开发平台。在本次会议中，您将了解如何使用 Aspire 将 AWS 集成到您的开发环境中。Aspire 和 AWS 的联合集成可以消除将工具收集到一个简单的 F5 调试会话中的需求，该会话在启动您的应用程序时预置了所有 AWS 资源并将其连接到您的应用程序。"
  },
  {
    "SessionId": 68,
    "BeginDateTime": "2024-11-14T20:30:00+00:00",
    "EndDateTime": "2024-11-14T21:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T04:30:00Z",
    "EndDateTimeInCST": "2024-11-15T05:00:00Z",
    "Title": "Orleans: Microsoft's distributed systems framework for .NET",
    "Speaker": "Reuben Bond",
    "Description": "Microsoft Orleans underpins many cloud services at Microsoft. It gives teams a straightforward approach to building efficient, reliable, elastically scalable cloud services quickly. In this session we will introduce Orleans and describe its core features and what's new in 2024. We will follow with a technical dive deep into placement & load balancing in Orleans, covering the latest advancements for reliability and performance, including some cutting-edge recent work in rebalancing & locality-aware repartitioning.",
    "DescriptionInZh": "Microsoft Orleans 是 Microsoft 的许多云服务的基础。它为团队提供了一种简单的方法来快速构建高效、可靠、可弹性缩放的云服务。在本次会议中，我们将介绍 Orleans 并介绍其核心功能和 2024 年的新增功能。我们将对奥尔良的放置和负载均衡进行技术深入探讨，涵盖可靠性和性能的最新进展，包括一些近期在再平衡和地方感知重新分区方面的前沿工作。"
  },
  {
    "SessionId": 69,
    "BeginDateTime": "2024-11-14T21:00:00+00:00",
    "EndDateTime": "2024-11-14T21:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T05:00:00Z",
    "EndDateTimeInCST": "2024-11-15T05:30:00Z",
    "Title": "What's New for Oracle Database in .NET 9 and Entity Framework Core 9",
    "Speaker": "Alex Keh",
    "Description": "Learn about the new .NET 9 and EF Core 9 capabilities supported with Oracle Data Provider for .NET (ODP.NET). New .NET and Oracle database capabilities include controlling query parameterization, inlined uncorrelated subqueries, ToHashSetAsync methods support, passing complex type instances to ExecuteUpdate, auto-compiled models, and more. Join this session to see demos of these new features.",
    "DescriptionInZh": "了解适用于 .NET 的 Oracle Data Provider （ODP.NET） 支持的新 .NET 9 和 EF Core 9 功能。新的 .NET 和 Oracle 数据库功能包括控制查询参数化、内联不相关子查询、ToHashSetAsync 方法支持、将复杂类型实例传递给 ExecuteUpdate、自动编译模型等。加入此会议，观看这些新功能的演示。"
  },
  {
    "SessionId": 70,
    "BeginDateTime": "2024-11-14T21:30:00+00:00",
    "EndDateTime": "2024-11-14T22:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T05:30:00Z",
    "EndDateTimeInCST": "2024-11-15T06:00:00Z",
    "Title": "Unpacking the Newest in NuGet",
    "Speaker": "Allie Barry, Jon Douglas",
    "Description": "This session dives into the newest features and updates in NuGet, the package manager that powers .NET development. Whether you're a seasoned developer or just starting out, this talk will give you a comprehensive overview of what’s new in NuGet, how these features can streamline your workflow, and why they matter for your projects.",
    "DescriptionInZh": "本次会议深入探讨了 NuGet（支持 .NET 开发的包管理器）中的最新功能和更新。无论你是经验丰富的开发人员还是新手，此讲座都将全面概述 NuGet 中的新增功能、这些功能如何简化工作流，以及它们对项目的重要性。"
  },
  {
    "SessionId": 71,
    "BeginDateTime": "2024-11-14T22:00:00+00:00",
    "EndDateTime": "2024-11-14T22:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T06:00:00Z",
    "EndDateTimeInCST": "2024-11-15T06:30:00Z",
    "Title": ".NET Cross-Platform Development Supercharged with .NET 9, and Uno Platform",
    "Speaker": "Jérôme Laban",
    "Description": "The gap between the complexity of applications and the resources available to build them is widening rapidly. As developers, it's crucial to leverage familiar tools while embracing new ones that enhance productivity. \r\n  \r\nJoin Jerome Laban for an in-depth session on the latest advancements in the Uno Platform, including the newest support for .NET 9 . Jerome will discuss the performance benefits of moving to NET 9, the advantages of true single-project architecture and importance of using visual tooling such as Hot Reload and others.\r\n\r\nWhile AI is reshaping our industry, let's take a pragmatic approach to software development in\r\n2024. This session will help you cut through the buzz and focus on the tools that can deliver real\r\nvalue to your projects today.",
    "DescriptionInZh": "应用程序的复杂性与可用于构建它们的资源之间的差距正在迅速扩大。作为开发人员，利用熟悉的工具，同时采用可提高生产力的新工具至关重要。\r\n  \r\n加入 Jerome Laban 的深入会议，了解 Uno 平台的最新进展，包括对 .NET 9 的最新支持。Jerome 将讨论迁移到 NET 9 的性能优势、真正的单项目架构的优势以及使用可视化工具（如 Hot Reload 等工具）的重要性。\r\n\r\n虽然 AI 正在重塑我们的行业，但让我们采取务实的方法进行软件开发\r\n2024. 本次会议将帮助您消除嗡嗡声，专注于可以提供真实\r\n对您今天的项目有价值。"
  },
  {
    "SessionId": 72,
    "BeginDateTime": "2024-11-14T22:30:00+00:00",
    "EndDateTime": "2024-11-14T23:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T06:30:00Z",
    "EndDateTimeInCST": "2024-11-15T07:00:00Z",
    "Title": "New Features in the .NET 9 JIT",
    "Speaker": "Andy Ayers",
    "Description": "A deep dive into some of the many improvements made in the .NET 9 JIT, including new loop optimizations, stack allocation of objects, ARM64 SVE, improvements in AVX-512, and more!",
    "DescriptionInZh": "深入了解 .NET 9 JIT 中所做的许多改进中的一些，包括新的循环优化、对象的堆栈分配、ARM64 SVE、AVX-512 中的改进等等！"
  },
  {
    "SessionId": 73,
    "BeginDateTime": "2024-11-14T23:00:00+00:00",
    "EndDateTime": "2024-11-14T23:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T07:00:00Z",
    "EndDateTimeInCST": "2024-11-15T07:30:00Z",
    "Title": "Modernizing .NET Apps with Upgrade Assistant: New Capabilities for Seamless Upgrades",
    "Speaker": "McKenna Barlow",
    "Description": "In this session, we'll explore the latest enhancements to the .NET Upgrade Assistant, focusing on new capabilities designed to simplify and streamline your upgrade process. You'll learn how the tool now supports comprehensive upgrade assessments, providing in-depth insights into project compatibility and upgrade complexity. We’ll also cover expanded package support, including Central Package Management (CPM), to help you manage dependencies more efficiently. Whether you're modernizing legacy applications or preparing for future upgrades, this session will equip you with the knowledge and tools to make the transition smoother and faster.",
    "DescriptionInZh": "在本次会议中，我们将探讨 .NET 升级助手的最新增强功能，重点介绍旨在简化升级过程的新功能。您将了解该工具现在如何支持全面的升级评估，从而深入了解项目兼容性和升级复杂性。我们还将介绍扩展的包支持，包括集中包管理 （CPM），以帮助您更有效地管理依赖项。无论您是对旧应用程序进行现代化改造，还是为将来的升级做准备，本次会议都将为您提供知识和工具，使过渡更顺畅、更快速。"
  },
  {
    "SessionId": 74,
    "BeginDateTime": "2024-11-14T23:30:00+00:00",
    "EndDateTime": "2024-11-15T00:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T07:30:00Z",
    "EndDateTimeInCST": "2024-11-15T08:00:00Z",
    "Title": "C++ Interopability in .NET",
    "Speaker": "Justin Pierce",
    "Description": "Wield the power of over 25 years of C++ native libraries within .NET, using C#'s advanced interoperability features.",
    "DescriptionInZh": "使用 C++ 的高级互操作性功能，在 .NET 中利用超过 25 年的 C++ 原生库。"
  },
  {
    "SessionId": 75,
    "BeginDateTime": "2024-11-15T00:00:00+00:00",
    "EndDateTime": "2024-11-15T00:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-15T08:00:00Z",
    "EndDateTimeInCST": "2024-11-15T08:30:00Z",
    "Title": "Next-gen SQL projects with Microsoft.Build.Sql",
    "Speaker": "Drew Skwiers-Koballa",
    "Description": "Your database objects are stored as code for development in Visual Studio or VS Code with Microsoft.Build.Sql SDK-style SQL projects, but the advantages don’t stop there. SQL code analysis and other build-time tests can validate database code quality and correctness during continuous integration of code changes. With SQL projects delivering database object updates is easier and more reliable whether you're managing one database or a fleet of databases because the deployment plan is dynamically calculated through the SqlPackage CLI. In this session we’ll learn how to develop and deploy your database alongside your app components with SQL projects from the IDE to CI/CD.",
    "DescriptionInZh": "您的数据库对象作为代码存储在 Visual Studio 或 VS Code 中，以便使用 Microsoft.Build.Sql SDK 样式的 SQL 项目进行开发，但优势并不止于此。SQL 代码分析和其他构建时测试可以在持续集成代码更改期间验证数据库代码质量和正确性。对于 SQL 项目，无论您是管理一个数据库还是一组数据库，交付数据库对象更新都更容易、更可靠，因为部署计划是通过 SqlPackage CLI 动态计算的。在本次会议中，我们将学习如何使用从 IDE 到 CI/CD 的 SQL 项目来开发和部署数据库和应用程序组件。"
  },
  {
    "SessionId": 76,
    "BeginDateTime": "2024-11-15T16:00:00+00:00",
    "EndDateTime": "2024-11-15T16:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T00:00:00Z",
    "EndDateTimeInCST": "2024-11-16T00:30:00Z",
    "Title": "Build intelligent apps on .NET using Azure Communication Services",
    "Speaker": "Milan Kaur",
    "Description": "In this session, we will cover the details of building intelligent communication applications using .NET. Attendees will explore how to leverage the latest features of Azure Communication Services and Azure Open AI to create robust and scalable communication apps on .NET. We will cover how to add messaging channels such as SMS, WhatsApp and audio video capabilities into your AI apps using the latest gpt models.",
    "DescriptionInZh": "在本次会议中，我们将详细介绍如何使用 .NET 构建智能通信应用程序。与会者将探索如何利用 Azure 通信服务和 Azure Open AI 的最新功能在 .NET 上创建强大且可扩展的通信应用程序。我们将介绍如何使用最新的 gpt 模型将 SMS、WhatsApp 和音频视频功能等消息传递渠道添加到您的 AI 应用程序中。"
  },
  {
    "SessionId": 77,
    "BeginDateTime": "2024-11-15T16:30:00+00:00",
    "EndDateTime": "2024-11-15T17:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T00:30:00Z",
    "EndDateTimeInCST": "2024-11-16T01:00:00Z",
    "Title": "Secure intelligent apps with .NET 9 on App Service",
    "Speaker": "Jeff Martinez",
    "Description": "Make secure calls to Azure OpenAI from a .NET 9 app hosted on App Service",
    "DescriptionInZh": "从应用服务上托管的 .NET 9 应用对 Azure OpenAI 进行安全调用"
  },
  {
    "SessionId": 78,
    "BeginDateTime": "2024-11-15T17:00:00+00:00",
    "EndDateTime": "2024-11-15T17:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T01:00:00Z",
    "EndDateTimeInCST": "2024-11-16T01:30:00Z",
    "Title": "Beyond GitHub Copilot Tips and Tricks",
    "Speaker": "April Yoho",
    "Description": "In this session April will take you beyond simple prompts with GitHub Copilot. We will look at how to build a testing suite for your .NET code and follow the journey alongside GitHub Copilot from beginning to end. \r\nWe'll also explore the end to end capability of GitHub Copilot workspaces and how it can help with the start of an issue, through to planning and delivery. A true DevOps copilot when developing your .NET code!",
    "DescriptionInZh": "在本次会议中，April 将带您超越 GitHub Copilot 的简单提示。我们将了解如何为您的 .NET 代码构建测试套件，并从头到尾跟随 GitHub Copilot 的旅程。\r\n我们还将探索 GitHub Copilot 工作区的端到端功能，以及它如何帮助从问题的开始到规划和交付。开发 .NET 代码时，真正的 DevOps 副驾驶！"
  },
  {
    "SessionId": 79,
    "BeginDateTime": "2024-11-15T17:30:00+00:00",
    "EndDateTime": "2024-11-15T18:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T01:30:00Z",
    "EndDateTimeInCST": "2024-11-16T02:00:00Z",
    "Title": "Smart UI Powered by AI 🚀",
    "Speaker": "Sam Basu",
    "Description": "It is the age of AI and there are some big opportunities for .NET developers - infuse apps with solutions powered by Generative AI and Large Language Models (LLMs), as well as, boost developer productivity. \r\n\r\n.NET client apps can benefit from AI-powered Smart UI Components, like AI Prompts, Smart Grid/ComboBox search with Local Embeddings and searching/manipulating PDFs with Semantic search. Enterprise workflows often require working with desktop apps and document processing - rich text editing could make users productive with AI-powered completions, while spreadsheets could perform formulations/automations. Web developers could dynamically style web UI components with AI-powered theming or get contextual assistance while writing Blazor code in a browser REPL. Towards developer productivity, GitHub Copilot could be extended with custom chat agents to preserve developer context and get deeply contextual code completions, powered by documentation RAG. Let's explore what's next for AI-powered .NET UI towards wonderful UX and optimized developer productivity tools.",
    "DescriptionInZh": "现在是 AI 时代，.NET 开发人员有一些巨大的机会 - 为应用程序注入由生成式 AI 和大型语言模型 （LLM） 提供支持的解决方案，并提高开发人员的工作效率。\r\n\r\n.NET 客户端应用程序可以从 AI 驱动的智能 UI 组件中受益，例如 AI 提示、使用本地嵌入的智能网格/ComboBox 搜索以及使用语义搜索搜索/操作 PDF。企业工作流程通常需要使用桌面应用程序和文档处理 - 富文本编辑可以通过 AI 驱动的完成来提高用户的工作效率，而电子表格可以执行公式/自动化。Web 开发人员可以使用 AI 支持的主题动态设置 Web UI 组件的样式，或者在浏览器 REPL 中编写 Blazor 代码时获得上下文帮助。为了提高开发人员的工作效率，可以使用自定义聊天代理扩展 GitHub Copilot，以保留开发人员上下文并获得由文档 RAG 提供支持的深度上下文代码完成。让我们探讨一下 AI 驱动的 .NET UI 的下一步发展，以实现出色的 UX 和优化的开发人员生产力工具。"
  },
  {
    "SessionId": 80,
    "BeginDateTime": "2024-11-15T18:00:00+00:00",
    "EndDateTime": "2024-11-15T18:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T02:00:00Z",
    "EndDateTimeInCST": "2024-11-16T02:30:00Z",
    "Title": "Deep dive on native AOT",
    "Speaker": "Michal Strehovský",
    "Description": "Native AOT has been part of .NET since .NET 7. With each release we're extending the areas where it can be used. From console apps in .NET 7, through ASP.NET web APIs in .NET 8, to MAUI in .NET 9. It is your best bet if you need your .NET app to start fast and use as little memory as possible.\r\n\r\nBut how does native AOT actually work? Why does it start so fast? How can we fit an entire .NET runtime, the base class libraries, and your code in a 1 MB executable file?\r\n\r\nIn this talk we'll peek into the internal workings of native AOT compilation and look at what it does at run time.",
    "DescriptionInZh": "自 .NET 7 以来，本机 AOT 一直是 .NET 的一部分。对于每个版本，我们都会扩展其可以使用的区域。从 .NET 7 中的控制台应用，到 .NET 8 中的 ASP.NET Web API，再到 .NET 9 中的 MAUI。如果您需要 .NET 应用程序快速启动并使用尽可能少的内存，这是您最好的选择。\r\n\r\n但是原生 AOT 实际上是如何运作的呢？为什么它开始得这么快？如何将整个 .NET 运行时、基类库和您的代码放入一个 1 MB 的可执行文件中？\r\n\r\n在本次演讲中，我们将简要介绍本机 AOT 编译的内部工作原理，并了解它在运行时的作用。"
  },
  {
    "SessionId": 81,
    "BeginDateTime": "2024-11-15T18:30:00+00:00",
    "EndDateTime": "2024-11-15T19:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T02:30:00Z",
    "EndDateTimeInCST": "2024-11-16T03:00:00Z",
    "Title": "Create great MIDI 2.0 apps using Windows MIDI Services and C#",
    "Speaker": "Pete Brown",
    "Description": "The open source Windows MIDI Services project (https://aka.ms/midi) is nearing its first consumer release, and is getting ready to be in-boxed in Windows. In this session, learn about what the new MIDI stack brings, and then learn how to use the developer preview bits available today to create MIDI 2.0 and MIDI 1.0 apps for Windows, including virtual devices, USB, and more, all using C#.",
    "DescriptionInZh": "开源 Windows MIDI 服务项目 （https://aka.ms/midi） 即将发布其第一个消费者版本，并准备在 Windows 中内置。在本次会议中，了解新的 MIDI 堆栈带来了什么，然后了解如何使用目前提供的开发人员预览位创建适用于 Windows 的 MIDI 2.0 和 MIDI 1.0 应用程序，包括虚拟设备、USB 等，所有这些都使用 C#。"
  },
  {
    "SessionId": 82,
    "BeginDateTime": "2024-11-15T19:00:00+00:00",
    "EndDateTime": "2024-11-15T19:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T03:00:00Z",
    "EndDateTimeInCST": "2024-11-16T03:30:00Z",
    "Title": "What’s New in .NET 9 for Data Access: From Document DBs to Vector DBs",
    "Speaker": "Luis Quintanilla, Jiří Činčura",
    "Description": "This session will provide an in-depth look at the new data access features in .NET 9, focusing on the seamless integration of Document DB Providers like MongoDB, and the cutting-edge capabilities of Vector Databases including Azure SQL, Qdrant, Pinecone, and many others. We’ll also cover the new vector search abstractions for advanced data queries. Learn how these updates can streamline your data workflows and enable more efficient and scalable application development.",
    "DescriptionInZh": "本次会议将深入探讨 .NET 9 中的新数据访问功能，重点介绍文档数据库提供程序（如 MongoDB）的无缝集成，以及矢量数据库（包括 Azure SQL、Qdrant、Pinecone 等）的尖端功能。我们还将介绍用于高级数据查询的新向量搜索抽象。了解这些更新如何简化您的数据工作流程并实现更高效、可扩展的应用程序开发。"
  },
  {
    "SessionId": 83,
    "BeginDateTime": "2024-11-15T19:30:00+00:00",
    "EndDateTime": "2024-11-15T20:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T03:30:00Z",
    "EndDateTimeInCST": "2024-11-16T04:00:00Z",
    "Title": "Audit Like a Pro: Securing Your NuGet Packages",
    "Speaker": "Jon Douglas, Andy Zivkovic",
    "Description": "In this session, we will explore the importance of regularly auditing your NuGet dependencies to identify and address potential security vulnerabilities. You will learn how to use various tools and techniques to scan your dependencies, understand common vulnerabilities, and take proactive steps to secure your .NET projects. By the end of this session, you'll be equipped with practical strategies to ensure your code remains secure and up-to-date in an ever-evolving threat landscape.",
    "DescriptionInZh": "在本次会议中，我们将探讨定期审核 NuGet 依赖项以识别和解决潜在安全漏洞的重要性。您将学习如何使用各种工具和技术来扫描依赖项、了解常见漏洞并采取主动措施来保护您的 .NET 项目。在本次会议结束时，您将掌握实用策略，以确保您的代码在不断变化的威胁环境中保持安全和最新。"
  },
  {
    "SessionId": 84,
    "BeginDateTime": "2024-11-15T20:00:00+00:00",
    "EndDateTime": "2024-11-15T20:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T04:00:00Z",
    "EndDateTimeInCST": "2024-11-16T04:30:00Z",
    "Title": "\"Intelligenize\" your WinForms Apps for an amazing new customer experience!",
    "Speaker": "Klaus Loeffelman",
    "Description": "WinForms has been a cornerstone of countless mature LOB applications for nearly 30 years, encapsulating critical domain knowledge. They are the perfect candidates for retrofitting AI- and LLM support, but: modernizing such systems in a feasible way excludes starting from scratch - \"intelligenizing\" existing functionalities is the efficient way to go.\r\n\r\nLet's explore how the new .NET 9 features can support you to combine AI/LLMs into your existing LOB to achieve stunning results in minutes. Join us to discover new AI tricks for even the most mature dog and take your WinForms LOB apps to the next level!\r\n\r\nHighlights:\r\n\r\n* Combine WinForms components with Semantic Kernel\r\n* The Speak-German-in-just-2-Minutes AI-WinForms App! Seriously! Would I lie to you? 😊\r\n* Discover the next level: Intelligent Assistant UI Controls for LOB Apps\r\n* Write graphic-rich, high-performance chat-assistant controls with WinForms Blazor Hybrid",
    "DescriptionInZh": "近 30 年来，WinForms 一直是无数成熟 LOB 应用程序的基石，封装了关键的领域知识。它们是改造 AI 和 LLM 支持的完美候选者，但是：以可行的方式对此类系统进行现代化改造不包括从头开始 - “智能化”现有功能是有效的方法。\r\n\r\n让我们探讨一下新的 .NET 9 功能如何支持您将 AI/LLM 合并到现有 LOB 中，从而在几分钟内获得令人惊叹的结果。加入我们，即使是最成熟的狗也能发现新的 AI 技巧，并将您的 WinForms LOB 应用程序提升到一个新的水平！\r\n\r\n突出：\r\n\r\n* 将 WinForms 组件与 Semantic Kernel 相结合\r\n* 只需 2 分钟即可说德语的 AI-WinForms 应用程序！认真地！我会骗你吗？😊\r\n* 发现下一个级别：LOB 应用程序的智能助手 UI 控件\r\n* 使用 WinForms Blazor Hybrid 编写图形丰富的高性能聊天助手控件"
  },
  {
    "SessionId": 85,
    "BeginDateTime": "2024-11-15T20:30:00+00:00",
    "EndDateTime": "2024-11-15T21:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T04:30:00Z",
    "EndDateTimeInCST": "2024-11-16T05:00:00Z",
    "Title": "Exploring the New Fluent UI Blazor Library: Next-Gen Web Components and Architectural Innovations",
    "Speaker": "Vincent Baaij, Denis Voituron",
    "Description": "Join us for an in-depth session on the upcoming new major version of the Fluent UI Blazor library, which introduces cutting-edge Web Components and significant architectural changes. This session will cover:\r\n- Overview of New Features: Discover the enhancements in the new Fluent UI Blazor library, including updated Web Components \r\n- Architectural Changes:  Learn about the major architectural shifts that improve performance, scalability, and maintainability. \r\n- Migration Guide: Yes, there will be a lot of breaking changes! But we will guide you with practical tips and best practices for migrating your existing projects to the new version\r\n- Hands-On Demos: See the new features in action with live coding demonstrations.",
    "DescriptionInZh": "加入我们，参加有关即将推出的 Fluent UI Blazor 库的新主要版本的深入会议，该版本引入了尖端的 Web 组件和重大的体系结构更改。本次会议将涵盖：\r\n- 新功能概述：发现新的 Fluent UI Blazor 库中的增强功能，包括更新的 Web 组件\r\n- 架构变更：了解提高性能、可扩展性和可维护性的重大架构转变。\r\n- 迁移指南：是的，会有很多突破性的变化！但是，我们将指导您将现有项目迁移到新版本的实用技巧和最佳实践\r\n- 动手演示：通过实时编码演示了解新功能的实际应用。"
  },
  {
    "SessionId": 86,
    "BeginDateTime": "2024-11-15T21:00:00+00:00",
    "EndDateTime": "2024-11-15T21:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T05:00:00Z",
    "EndDateTimeInCST": "2024-11-16T05:30:00Z",
    "Title": "The force is strong in LLMs - building an open source Star Wars inspired copilot in .NET",
    "Speaker": "Jim Bennett",
    "Description": "In the Star Wars universe, many pilots have an astromech copilot. Luke had R2-D2 in the back of his X-Wing for example. As developers, we too have copilots. Although these are not as cool as R2, and don’t help us blow up the Death Star, they do help us with our day to day tasks like writing code.\r\n\r\nWhilst copilots can be boring, Jim thought it would be fun to create one inspired by Star Wars to help him with important tasks, such as describing his Lego collection (Star Wars Lego of course), and helping him write code, all done in the style of a Jedi.\r\n\r\nIn this session, Jim will walk you through the steps to build your own copilot, using the Pieces .NET SDK. By leveraging this SDK, your copilot can not only access an LLM of your choice from a range of cloud and on-device models such as Microsoft Phi and OpenAI GPT-4o, but you can also add assets to your chat’s context, such as code, documents, and plans for the Death Star. And just like a Jedi can sense the living force, this copilot can sense your presence and answer questions without needing additional documentation, such as summarizing your research on Wookiepedia. And best of all, reply like Yoda, it can!\r\n\r\nBy the end of this session, you will be able to complete your apprenticeship and build your own open source AI copilot.",
    "DescriptionInZh": "在《星球大战》宇宙中，许多飞行员都有一个宇航机甲副驾驶。例如，Luke 的 X 翼后部有 R2-D2。作为开发人员，我们也有副驾驶。虽然这些不如 R2 酷，也不能帮助我们炸毁死星，但它们确实可以帮助我们完成日常任务，比如编写代码。\r\n\r\n虽然副驾驶可能很无聊，但 Jim 认为创建一个受《星球大战》启发的副驾驶来帮助他完成重要任务会很有趣，例如描述他的乐高收藏（当然是《星球大战》乐高），并帮助他编写代码，所有这些都以绝地武士的风格完成。\r\n\r\n在本次会议中，Jim 将引导您完成使用 Pieces .NET SDK 构建自己的 Copilot 的步骤。通过利用此 SDK，您的 copilot 不仅可以从一系列云和设备模型（如 Microsoft Phi 和 OpenAI GPT-4o）中访问您选择的 LLM，还可以将资产添加到聊天的上下文中，例如代码、文档和死星计划。就像绝地武士可以感知到生命力一样，这个副驾驶可以感知到你的存在并回答问题，而无需额外的文件，例如总结你在 Wookiepedia 上的研究。最重要的是，像 Yoda 一样回复，它可以！\r\n\r\n在本次会议结束时，您将能够完成学徒期并构建自己的开源 AI 副驾驶。"
  },
  {
    "SessionId": 87,
    "BeginDateTime": "2024-11-15T21:30:00+00:00",
    "EndDateTime": "2024-11-15T22:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T05:30:00Z",
    "EndDateTimeInCST": "2024-11-16T06:00:00Z",
    "Title": "Boosting WPF Performance - Upcoming Improvements",
    "Speaker": "Ashish Kumar Singh",
    "Description": "This talk will focus on performance improvements in WPF DataGrid and other areas in WPF. We will be exploring the work in progress and improvements lined up in WPF for upcoming .NET releases. Join us to learn how to take full advantage of the performance enhancements in WPF and deliver responsive, high-performing applications.",
    "DescriptionInZh": "本次演讲将重点介绍 WPF DataGrid 和 WPF 中其他方面的性能改进。我们将探索 WPF 中正在进行的工作和改进，以便为即将发布的 .NET 版本做好准备。加入我们，了解如何充分利用 WPF 中的性能增强并交付响应迅速的高性能应用程序。"
  },
  {
    "SessionId": 88,
    "BeginDateTime": "2024-11-15T22:00:00+00:00",
    "EndDateTime": "2024-11-15T22:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T06:00:00Z",
    "EndDateTimeInCST": "2024-11-16T06:30:00Z",
    "Title": "Infuse AI in your Windows apps with .NET",
    "Speaker": "Nikola Metulev, Alexandre Zollinger Chohfi",
    "Description": "Join us for a demo packed session where you will learn what you can do with AI on Windows and how to add AI based features to your Windows apps to delight and empower your users. With Windows Copilot Runtime, developers can leverage APIs backed by on-device models such as Phi Silica and use frameworks and tools to leverage the latest open source or proprietary models locally within their apps",
    "DescriptionInZh": "加入我们的演示打包会议，您将在其中了解可以在 Windows 上使用 AI 执行哪些操作，以及如何将基于 AI 的功能添加到您的 Windows 应用程序，以取悦和增强您的用户。借助 Windows Copilot 运行时，开发人员可以利用由设备模型（如 Phi Silica）支持的 API，并使用框架和工具在其应用程序中本地利用最新的开源或专有模型"
  },
  {
    "SessionId": 89,
    "BeginDateTime": "2024-11-15T22:30:00+00:00",
    "EndDateTime": "2024-11-15T23:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T06:30:00Z",
    "EndDateTimeInCST": "2024-11-16T07:00:00Z",
    "Title": "Build .NET applications from the Cloud with Microsoft Dev Box and Visual Studio",
    "Speaker": "Sebastian Hernandez, Vedha Ranganathan",
    "Description": "Discover how Microsoft engineers have revolutionized their .NET development with Microsoft Dev Box and Visual Studio. Learn how they have streamlined their development processes using various task-focused cloud development tools. Gain practical insights into coding, testing, and deploying applications from the cloud, and explore the latest and most advanced features of Visual Studio and Dev Box.",
    "DescriptionInZh": "了解 Microsoft 工程师如何利用 Microsoft Dev Box 和 Visual Studio 彻底改变其 .NET 开发。了解他们如何使用各种以任务为中心的云开发工具简化开发流程。获得有关从云编码、测试和部署应用程序的实用见解，并探索 Visual Studio 和 Dev Box 的最新和最先进的功能。"
  },
  {
    "SessionId": 90,
    "BeginDateTime": "2024-11-15T23:00:00+00:00",
    "EndDateTime": "2024-11-15T23:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T07:00:00Z",
    "EndDateTimeInCST": "2024-11-16T07:30:00Z",
    "Title": "How Fidelity uses .NET MAUI for Cross-platform desktop",
    "Speaker": "David Ortinau, Matthew Faust, Kevin Bieri",
    "Description": "Kevin and Matthew join us from Fidelity to share their experiences and successes using .NET MAUI to power the next generation of their Active Trader Pro desktop client. We'll get into:\r\n\r\nOptimizing UI Dispatch for MAUI Applications\r\nWebView Pooling and Optimizations for OSX and Windows\r\nMDI multi-window desktop interfaces\r\nControlled Initialization and Shutdown sequences for MAUI\r\nDynamic Context Menus",
    "DescriptionInZh": "Kevin 和 Matthew 从 Fidelity 加入我们，分享他们使用 .NET MAUI 为其下一代 Active Trader Pro 桌面客户端提供支持的经验和成功。我们将进入：\r\n\r\n优化 MAUI 应用程序的 UI 调度\r\n适用于 OSX 和 Windows 的 WebView 池和优化\r\nMDI 多窗口桌面界面\r\nMAUI 的受控初始化和关闭序列\r\n动态上下文菜单"
  },
  {
    "SessionId": 91,
    "BeginDateTime": "2024-11-15T23:30:00+00:00",
    "EndDateTime": "2024-11-16T00:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T07:30:00Z",
    "EndDateTimeInCST": "2024-11-16T08:00:00Z",
    "Title": "AI at the Edge with Meadow and .NET",
    "Speaker": "Adrian Stevens",
    "Description": "Explore the intersection of AI and edge computing with Meadow and .NET. This talk delves into implementing TensorFlow Lite for Microcontrollers on the Meadow F7, empowering developers to run machine learning models directly on microcontrollers. We'll also examine innovative AI sensors from companies like Useful Sensors, such as the Tiny Code Reader and Person Sensor, which offer plug-and-play AI functionalities. Join us to learn how to harness these tools to create intelligent, efficient, and responsive edge devices.",
    "DescriptionInZh": "探索 AI 和边缘计算与 Meadow 和 .NET 的交集。本次演讲深入探讨了如何在 Meadow F7 上实现适用于微控制器的 TensorFlow Lite，使开发人员能够直接在微控制器上运行机器学习模型。我们还将研究来自 Useful Sensors 等公司的创新 AI 传感器，例如 Tiny Code Reader 和 Person Sensor，它们提供即插即用的 AI 功能。加入我们，了解如何利用这些工具创建智能、高效且响应迅速的边缘设备。"
  },
  {
    "SessionId": 92,
    "BeginDateTime": "2024-11-16T00:00:00+00:00",
    "EndDateTime": "2024-11-16T00:30:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T08:00:00Z",
    "EndDateTimeInCST": "2024-11-16T08:30:00Z",
    "Title": "MVVM Building Blocks for WinUI and WPF Development",
    "Speaker": "Michael Hawker, Sergio Pedri",
    "Description": "Embark with us on a hands-on journey to acquire the foundational elements of modern Windows app development. We'll show you how XAML, Data Binding, and MVVM come together to empower your development process, increase agility, and simplify your codebase!\r\n\r\nYou'll end up with the essential skills to start crafting applications with WinUI or WPF and empower yourself to create robust, scalable, and maintainable Windows applications.",
    "DescriptionInZh": "与我们一起踏上实践之旅，获取现代 Windows 应用程序开发的基本元素。我们将向您展示 XAML、数据绑定和 MVVM 如何结合在一起，以增强您的开发过程、提高敏捷性并简化您的代码库！\r\n\r\n您最终将获得开始使用 WinUI 或 WPF 制作应用程序的基本技能，并有能力创建强大、可扩展且可维护的 Windows 应用程序。"
  },
  {
    "SessionId": 93,
    "BeginDateTime": "2024-11-16T00:30:00+00:00",
    "EndDateTime": "2024-11-16T01:00:00+00:00",
    "BeginDateTimeInCST": "2024-11-16T08:30:00Z",
    "EndDateTimeInCST": "2024-11-16T09:00:00Z",
    "Title": "Easy CQRS with Data API builder and SQL Server",
    "Speaker": "Jerry Nixon",
    "Description": "CQRS can feel complicated, but it doesn’t have to be. In this session, we'll show you how to implement CQRS effortlessly using Data API builder and SQL Server. By separating your read and write operations, you’ll boost performance, scalability, and maintainability. You'll see how to set up a scalable, secure API with REST & GraphQL endpoints—no code required. Whether you’re working in the cloud or on-prem, we’ll help you streamline your architecture and speed up your development process.",
    "DescriptionInZh": "CQRS 可能感觉很复杂，但并非必须如此。在本次会议中，我们将向您展示如何使用 Data API Builder 和 SQL Server 轻松实现 CQRS。通过分离读取和写入操作，您将提高性能、可扩展性和可维护性。您将看到如何使用REST和GraphQL端点设置可扩展、安全的API——无需代码。无论您是在云中工作还是在本地工作，我们都将帮助您简化架构并加快开发过程。"
  }
]